#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    int x,y;cin>>x>>y;
    vector<int>A(1001);
    int s=1;
    for(int i=1;i<=1000;i++){
        for(int j=1;j<=i+1;j++){
            if(s+1>1000)break;
            A[s+1]=A[s]+i;
            s++;
        }
        if(s>=1000)break;
    }
    cout<<A[y]-A[x-1]<<endl;
}

// begin signature
// +----------------------------------------+
// |覇義群和労汎允山山山山山允允洪労李和和耗|
// |陽和労允せビミミシミミミミビ火允山允汎洪|
// |労允ビシㇵㇸヘ一・　　　ㇸㇵミミミ丁火山|
// |せミ一ㇸ一　ㇸㇵㇸ・・ㇸ・　　　・一ヘ丁|
// |シ・ㇸ　一ヘ　ㇸㇵㇵㇵㇸ・ヘシシヘㇵ　ㇸ|
// |ヘ　　ㇵシ・一ミビ火火ビシㇸ一丁せ火丁ヘ|
// |ヘ・・シシ　ヘビ允洪労洪山せビヘミ山汎せ|
// |ヘ　ㇸミミ　シ山李奏李汎汎労労洪せミ・労|
// |ㇵㇸヘ火ヘシ労陽陽李李洪耗耗李洪汎せミㇸ|
// |　一ビ丁山奏覇義耗和洪耗群労せ火ビ丁ミㇵ|
// |一ビㇵ労群義奏和労洪奏和洪山ビミヘ一一一|
// |シㇵ允和陽耗李耗李労李允火シㇸ　一ㇵ一ㇸ|
// |ㇵシ山労耗労李洪汎允汎火ヘ　一ミビ火火丁|
// |・・ミ山李李汎せビ丁丁ビㇵ・シ丁シヘシミ|
// |ミ一　シせ洪允ビビ丁ㇸ一ㇵㇸミヘ・　・　|
// |山ミㇵ　シ火山ミビ丁ㇸㇵ　ㇸミㇸ一シ丁ミ|
// |汎火丁ㇵ・シビヘせミ　シヘㇵ一一丁せ允山|
// |洪せせ丁ヘㇸシ丁ビ一一ビ一ㇵㇸ丁允李和洪|
// |労洪允せビミシシシ　ミ一ヘ　ミ允和陽耗汎|
// |和李李洪允火ミせヘ・・　ㇵㇸ丁允李和洪せ|
// +----------------------------------------+
// 2026 (April 18th) 18:58:23
// end signature


