#include <bits/stdc++.h>

using namespace std;

int main() {
    int M,D;cin>>M>>D;
    if(M==1&&D==7)cout<<"Yes\n";
    else if(M==3&&D==3)cout<<"Yes\n";
    else if(M==5&&D==5)cout<<"Yes\n";
    else if(M==7&&D==7)cout<<"Yes\n";
    else if(M==9&&D==9)cout<<"Yes\n";
    else cout<<"No\n";
}

// begin signature
// +----------------------------------------+
// |陽奏李洪汎山せ火火火火火火せ山汎洪李耗陽|
// |和労允せビミㇸ丁せ山允せ丁ヘ　火山洪李奏|
// |允せ丁ヘミ允李ㇸ　　　　・せミㇸ火允労和|
// |ビシミ洪一　ㇸ一・　　・・　　ヘ　せ汎洪|
// |ヘ丁・ㇸ・シせ汎洪洪允火シ・ヘㇸ一　火山|
// |ㇵ山一ㇸ火労一　一一ㇵㇵ一ヘ一ㇸ一　　ミ|
// |ㇵ　一丁ㇸㇸㇸ・ㇵミ丁ビビミヘㇸㇸ一・　|
// |ヘ　ㇸ汎・一シミシビ山允允山火ミ一・シㇵ|
// |ヘㇸ火一一せミシビ山洪李李労汎火シ・ㇵヘ|
// |　・・火火シシ火汎労耗群群和洪せシ・ㇸ　|
// |　ㇵ洪火シヘ火汎和奏慶慶群李允ビㇵ　ㇵヘ|
// |ヘ労山丁ㇸミ山労耗群慶陽耗洪せ丁一・ㇵㇸ|
// |山労山ミㇸシ火允労和奏耗李汎火ヘ　一・ㇸ|
// |ミ和汎火ヘ　ヘ丁せ汎労労洪山ビヘ　ㇵミミ|
// |　和李山丁一　ㇸシビせ山山火丁ヘ　ㇵ丁火|
// |　シ李汎火ヘ　　　ㇵシミミミヘㇸ・ヘビビ|
// |　一汎汎火ヘ　・・・　ㇸㇸ・　一シビ丁シ|
// |　一せ山ミㇸ　・ㇸㇵ一一・ㇸ　ㇵ丁火火ビ|
// |ㇸㇸ丁丁ㇵ　ㇸ　・・・ㇸ・・ヘビ允洪允火|
// |　丁ㇵシ一ㇸㇸ・・・・・・ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (April 4th) 23:01:37
// end signature
