#include <bits/stdc++.h>

using namespace std;

int main() {
    int R,C;cin>>R>>C;
    for (int i=1;i<=C;i++)cout<<"#";
    cout<<endl;
    for (int i=2;i<R;i++){
        cout<<"#";
        for (int i=2;i<C;i++)cout<<".";
        cout<<"#";
        cout<<endl;
    }
    for (int i=1;i<=C;i++)cout<<"#";
    cout<<endl;
}

// begin signature
// +----------------------------------------+
// |洪允せ火火せ山汎労李労労労汎允允汎洪労和|
// |ミㇵㇸ・ㇸ一ヘ丁ビビビビ丁シヘヘシ丁火允|
// |ㇵシミ丁ミヘㇸ・・　　　ㇸㇵㇵㇵㇸ　ㇵ丁|
// |允洪洪洪汎山ビヘㇸ一ミシシシミビビシㇸ一|
// |奏群陽陽耗洪せ丁ヘㇸ・　・ㇵㇸ　一ミビㇵ|
// |覇覇覇群労せシ・ヘ・ㇵミビビミ丁ミㇸ一丁|
// |覇覇覇奏洪ビㇸ一ヘㇸ丁せビヘㇸㇵミ火丁ㇸ|
// |覇覇覇奏汎ミ・ヘㇵㇵせ李李允丁・ㇵ　シせ|
// |覇覇慶李せ一　丁　丁洪群義耗允ミㇸ丁ㇸヘ|
// |覇覇奏允ヘㇸミ・ミ洪群奏群奏汎シ・ㇵシㇸ|
// |覇奏洪ミㇸㇵㇵシ汎奏群奏耗和洪せシ・シ一|
// |奏汎丁　ㇸミ　丁労労汎山山山允汎ビㇸヘ一|
// |和せ一ヘヘㇵㇵヘ山火シㇵ一一ヘ丁せミ一・|
// |和せㇵヘせㇵヘㇵㇵㇵ　ㇵシシヘ一・シせヘ|
// |群汎シ一せ山シ・ミ・シ火允汎汎山ビヘ・丁|
// |義労丁　丁汎允丁ㇸㇵ火洪和奏洪火ヘ・　　|
// |陽洪ミㇸㇸ丁允ミ・ビ洪奏陽労ビ一一丁火ビ|
// |和山一シミㇵ丁　ビ労陽陽労ビ・ミ允労李汎|
// |允丁・火山火・丁洪陽義李ビ　丁洪群慶陽労|
// |ミミㇸ火汎シ一山耗覇奏允ヘㇵ允奏覇覇義労|
// +----------------------------------------+
// 2026 (April 4th) 23:03:45
// end signature
