#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++)cin>>A[i];
    int c=0;
    for(int i=2;i<=N-1;i++)c+=A[i-1]<A[i]&&A[i]>A[i+1];
    cout<<c<<endl;
}

// begin signature
// +----------------------------------------+
// |李李洪允山せ火ビビビビビビ火火山允洪労和|
// |汎允せビ丁シヘヘヘヘヘヘヘシミビ火山汎洪|
// |火ビミヘ一・ㇵㇸ・　　　・ㇸㇵシ丁せせ山|
// |シヘㇸ・一・・一ㇸ　　　ㇸ・・ㇵシミミ丁|
// |ㇸ・・一　一　・・　　　　ㇸ・　一一一ㇵ|
// |一ㇸ・　　　ㇸ　ㇸ・　一ㇸ・・　　　ㇸ・|
// |ヘ一　ㇸ一ヘㇸ・一・ㇵㇵヘヘヘㇵ一・・・|
// |一　ㇸヘミシ・ㇸㇸㇸシヘヘヘシ丁丁シㇵ　|
// |　・一ミ丁ㇵ　ㇵ　ㇵヘヘシヘㇸㇵシビミㇵ|
// |　・シ火シ・一　・　　　・一ㇵ・ㇵミビシ|
// |　ㇵ丁ヘ一ㇸㇸ一ㇵㇵㇵ一ㇸ　・ㇸ一ミ火シ|
// |・ヘ一　ㇸヘシミ丁丁丁ミシㇵㇸ　ㇸシ丁シ|
// |　一　一シ丁火せ山山山せ火丁シ一　ㇸㇵシ|
// |・・ㇸヘ丁せ允汎洪労洪洪汎山火ミㇵ一・・|
// |シㇸㇸシビ山汎労和耗耗李洪山ビミシㇵㇵㇵ|
// |シ・一ミ火允労和奏群耗李汎せ丁ヘㇸ　　　|
// |ㇵ　ヘビ山洪和群義群和洪山丁ヘ・ㇸㇵヘヘ|
// |　ㇵ丁山洪和群慶陽耗洪山丁ㇵ　ㇵミビビ丁|
// |一ミせ洪和群慶陽耗労允ビヘ　ㇵ丁せ允山ビ|
// |ヘビ允労奏義慶群和汎せミㇸㇸミせ汎労山ビ|
// +----------------------------------------+
// 2026 (July 25th) 22:01:01
// end signature
