#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,D;cin>>N>>D;
    string S;cin>>S;
    vector<int>bad(N+1);
    for(int i=1;i<=N;i++){
        if(S[i-1]=='G')for(int j=1;j<=N;j++){
            if(abs(i-j)<=D)bad[j]=true;
        }
    }
    cout<<N-accumulate(bad.begin()+1,bad.end(),0)<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇慶群耗李労労労洪洪労李和群耗李労労|
// |覇慶奏李汎山火ビビ丁丁丁ビせ允汎山火ビビ|
// |群李山ビヘ一シㇸ　シ火せ火ミミヘㇸ　　　|
// |汎ビㇵㇸㇵ　火允火丁ミ丁ビせ汎ビ・丁ビ丁|
// |ビㇸ一一ヘ汎火シㇸ　・　・ㇵ丁允せヘ労洪|
// |シ・ヘ　李せシ　ヘ・ㇵミビビミ丁火せミ　|
// |ミ・ㇵ一李せㇵ一ヘㇸ丁山洪洪汎洪洪汎汎丁|
// |ミ・ㇵ丁李火一ヘㇵㇵせ労洪李和奏陽群和洪|
// |ヘ一一允洪丁　丁　丁汎汎労労労汎李群陽耗|
// |　ㇸ火李せㇸミ・ミ汎和陽奏李李洪允李労洪|
// |・丁洪允ヘㇵㇵヘ允奏慶群奏奏労允せビ丁丁|
// |ㇸ火李火ㇸミ　丁洪群覇陽李允丁ヘ・　・　|
// |　丁洪山ヘㇵㇵヘせ労奏李山ミ・ㇵミビ火ビ|
// |ㇸ・ビ労せㇵㇵㇵ一ビ允洪火ㇵ一ビ允洪労労|
// |せㇵ　丁汎山シ・ミㇸ一ミ火一ヘせせビ丁ビ|
// |李せヘ　ミ允允丁ㇸ一シㇸ・ㇸシビヘ・　　|
// |群労せシㇸ丁山ミビヘㇸ　　　ビ一一ミビ丁|
// |義和允火シ一丁せ允丁ミビㇸシ・シ山洪労汎|
// |慶耗允汎山火丁丁ビㇵ山シ一　丁汎奏義群労|
// |覇群労耗和山せ洪丁ミ火ㇸヘㇵ山耗覇覇陽洪|
// +----------------------------------------+
// 2026 (July 25th) 22:03:11
// end signature
