#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    vector<int>P(N+1),Q(N+1);
    for(int i=1;i<=N;i++)cin>>P[i];
    for(int i=1;i<=N;i++)cin>>Q[i];
    vector<int>A(N+1);
    iota(A.begin(),A.end(),0);
    int c=0;
    do{
        if(A>P&&A<Q)c++;
    }while(next_permutation(A.begin()+1,A.end()));
    cout<<c<<endl;
}

// begin signature
// +----------------------------------------+
// |耗李洪允山火ビビビ丁ミミミ丁ビ火山汎洪李|
// |労允せビ丁シヘヘㇵ一一一一ㇵシミビせ允労|
// |山ビミヘ一・ㇸ　　・ㇸ・　　一ヘミ火山洪|
// |丁ヘㇸ・ㇸ　一・　・・・　　　ㇸヘ丁せ汎|
// |ㇵ・・・ㇸㇸ　一　　・　　ㇸㇸ・ㇸシビ山|
// |一　一　一　一　一　ㇸㇵヘヘㇵ一一ㇸヘビ|
// |ㇸ　ㇸ　一・ㇸㇸㇸ一ㇵㇵㇸビ丁丁ミヘㇸㇵ|
// |一一ㇸ・ㇸ　ㇸㇵミビせ允山火シㇸヘㇵ一ㇵ|
// |ミミミシヘ一ㇸヘ丁火允允允允せ丁ㇵ　・・|
// |ミミㇸㇸㇸㇸ一一シビビビ火ビミヘㇵヘシヘ|
// |せ　一・　ㇸㇸㇸヘヘヘヘシㇵㇸ　　・一シ|
// |・・・ㇸㇸㇵシミ丁丁ミミヘㇵ・・ㇵㇸ　ㇵ|
// |　　ㇸ一シ丁ビせせ山せ火ビミヘㇸ　一一　|
// |・　・ヘ丁火山汎洪洪洪汎允山火ミㇵㇸ　・|
// |ㇸㇸㇸシビ山汎労李和耗李洪山火丁シヘヘ一|
// |ㇵ・一ミ火允労和奏群奏李汎せ丁ヘ一・　　|
// |一　ヘビ山洪和奏陽群和洪山ビヘ・・一ㇵㇵ|
// |・ㇵ丁山洪和群慶陽耗労山ビヘ　一シ丁ビミ|
// |一ミせ洪和群慶義耗労允ビヘ　ㇵ丁せ山せビ|
// |ヘビ允労奏義慶群和汎せミㇸㇸミ火汎労山丁|
// +----------------------------------------+
// 2026 (July 25th) 22:05:14
// end signature
