#include <bits/stdc++.h>
using namespace std;
int main() {
    string S;cin>>S;
    int N=S.size();
    S.insert(S.begin(),' ');
    vector<vector<array<int,2>>>dp(N+1,vector<array<int,2>>(N+1));
    for(int i=1;i<=N;i++)dp[i][i][0]=dp[i][i][1]=true;
    for(int i=1;i<=N-1;i++)dp[i][i+1][1]=true;
    for(int i=1;i<=N-1;i++)dp[i][i+1][0]=S[i]==S[i+1];
    for(int g=2;g<N;g++){
        for(int i=1;i<=N-g;i++){
            int j=i+g;
            if(dp[i+1][j-1][0]){
                if(S[i]==S[j]){
                    dp[i][j][0]=1;
                } else {
                    dp[i][j][1]=1;
                }
            }
            if(dp[i+1][j-1][1]){
                if(S[i]==S[j]){
                    dp[i][j][1]=1;
                }
            }
        }
    }
    int ans=0;
    for(int i=1;i<=N;i++){
        for(int j=i;j<=N;j++){
            ans+=dp[i][j][0]|dp[i][j][1];
        }
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せ火丁ミシシミミミミミ丁火せ|
// |和労允せビミシヘ一・　　・ㇸ・ㇸㇸㇵシ丁|
// |汎せ丁ヘ一ㇸ　ㇸ一一ㇵㇵ一ㇵㇵ一ㇸ　ㇸヘ|
// |ビシㇸㇸ　一ㇵヘㇵㇸㇸㇸㇸㇵヘミシㇵ・ㇸ|
// |ヘ・ㇸ　ㇵヘ一　　ㇸ・　　・　一シ丁ヘ・|
// |ㇵ　一ㇸㇵㇸ・・ㇵ　一ヘシシシ一　一シミ|
// |ㇵ　一ㇸㇵ　・一一ㇸシ丁火せ火ビミ一　一|
// |ヘ　ㇸㇸㇵ　・ㇵ・一ミ丁ビせ允汎山ビシㇸ|
// |一ㇸㇸ一・ㇵ　ㇵ・・・一ㇵシビ火せ允火シ|
// |　・ㇸㇸ　ㇸㇵ一一一　・一一ヘシ丁火せミ|
// |　・ㇸ一一ㇸㇸ一・　・ㇸㇸ・　ㇸㇵミ火ミ|
// |・ㇵ・ミ・ㇵ・一ヘシミミミシㇵㇸ　ㇵミシ|
// |　一・シㇸㇸヘ丁火せ山山山せビミㇵ　一ミ|
// |・　・ㇵ　ㇵ丁せ允洪労労労洪汎山ビシㇸ・|
// |ㇸㇸ　ㇵ　ヘビ山洪李耗奏和洪山火丁ミミヘ|
// |ㇵ・一　ㇸシ火汎李奏陽奏李允火ミㇵㇸ・・|
// |ㇵ・シ・ㇵビ允李奏義群和汎火ミ一　一ㇵㇵ|
// |・ㇵㇸ一丁允李奏慶陽和洪火シ・一ミビビ丁|
// |ㇸ一ㇸ丁山労奏慶義耗洪せシ　ㇵビ山汎允火|
// |ㇵ　ヘ火汎和陽覇群李允丁一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (July 25th) 22:14:55
// end signature
