#include <bits/stdc++.h>
#include <atcoder/all>
using namespace std;
using mint=atcoder::modint998244353;
int main() {
    int N;cin>>N;
    string S;cin>>S;
    vector<vector<mint>>dp(N+2,vector<mint>(N+2));
    dp[1][1]=S[0]=='o';
    for(int i=2;i<=N;i++){
        if(S[i-1]=='o')dp[i][1]=dp[i-1][2]+dp[i-1][1]*2;
        else if(S[i-1]=='x')for(int c=2;c<=N;c++){
            dp[i][c]=dp[i-1][c-1]*c+2*c*dp[i-1][c]+dp[i-1][c+1]*c;
        }
    }
    cout<<dp[N][1].val()<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇覇覇義群奏耗李労労労李耗耗奏群義覇|
// |覇覇覇群李汎山せ火丁シシミ火火火せ允労奏|
// |覇奏洪せシㇵヘ火汎洪洪汎洪山ㇵ　一シ火洪|
// |李せヘ一ミ洪耗労一一ㇵㇵ山洪労丁ミㇸㇵ火|
// |火一一せ李シ　ヘ一　・　・丁ヘ洪ビ　ヘㇸ|
// |丁・シ汎丁　ミ　ヘ一一ミビ一ヘ允ヘ丁一ビ|
// |丁・シ・ミ　シ一丁・ビ汎李洪丁ㇸせ火ㇸシ|
// |ビ・ヘㇸビ・ㇵシヘㇵ山允李義労丁一允せ一|
// |ミㇵㇵシミㇵ　ビ　火允允山奏耗せ　火山汎|
// |　一ヘせㇸ一丁ㇸビ和陽群奏覇李丁・　ㇸシ|
// |・一丁・ミヘヘミ労義義義覇陽和山せビミ一|
// |一ミ一山一丁・火労洪洪労和群奏李汎允允火|
// |　ㇸ丁洪シヘヘシせ丁ヘ丁せ汎山丁ヘ一一ヘ|
// |一　丁労允ㇵシヘㇵシビ汎李せヘ　ヘミ丁ミ|
// |允ヘㇸ火労ビミㇸビㇸシせ汎ビ・シ山允山允|
// |群汎シ・ビミ山一ㇸㇵシ　ㇵシ一せ丁ㇵㇸㇸ|
// |覇耗允シ一火ミミ火ㇵ・　　　火ヘㇸミビ丁|
// |覇陽李せミヘヘミㇸ丁火シ・ビㇸミ允李和労|
// |覇陽允丁せㇸシヘ汎耗洪ミ丁・ビ李義覇慶耗|
// |覇和ビ山シミ　火耗陽洪ヘシヘ洪義覇覇覇耗|
// +----------------------------------------+
// 2026 (July 25th) 23:03:28
// end signature
