#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++)cin>>A[i];
    int a=0;
    for(int i=N;i>=1;i--)if(A[i]==0)a++;else break;
    cout<<a<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇覇義群耗和和和耗耗耗奏陽慶覇覇覇覇|
// |覇覇義耗労允せ火火火せせ山汎労耗陽覇覇覇|
// |義和汎火シ一ミミㇵㇸㇸㇸㇵミ火汎和陽慶覇|
// |洪火ㇵㇸ丁ㇵ・ヘシㇵ一ㇵㇵ　ㇵビ汎李李耗|
// |火一一ミ　シㇵ・ㇵ・　　一・一一丁ビビせ|
// |ミ・ヘ一ヘㇵ一・ㇵ一一ミビビミ丁ミㇵㇸ　|
// |丁・ヘㇸシ・シㇸシㇸビ允労李労洪労汎允シ|
// |丁・ㇵ・丁・ㇵヘヘㇵ山労和奏義陽義陽耗李|
// |シ一ミ一ㇵシ　ビ　丁ビ丁火允労耗和洪汎洪|
// |　ㇸ　シㇵ一ミㇸ丁山汎允せミせ火允和洪ビ|
// |・ㇸミㇸシㇵㇵシ汎群群奏労せㇵㇵせ李李火|
// |ㇸ一一ミㇸ丁　ビ李慶奏労允せヘ　ビ山洪せ|
// |　一火シㇵヘ一シ汎耗汎ビヘㇸ　　　一ミ山|
// |ㇸㇸせ　丁一シ一ヘせ火ㇵㇸシビ火火丁ㇵ・|
// |ㇵㇵ・火　ㇵシㇸミ　ヘ　ミ山洪汎せビ丁ビ|
// |シㇵシ・シㇸ火丁・ヘシ一火労洪火ㇵ　ㇸ・|
// |ㇵシ山シ　・火允ミ　ㇸ丁洪労火ㇸヘビせ火|
// |ㇸ山労ビㇸㇵビㇵㇵ火せ洪李ビ　丁汎和耗労|
// |丁労耗せヘヘ一ミ汎耗労和火　ビ李義覇慶和|
// |火和慶洪せシ一山奏慶李汎シヘ汎群覇覇慶李|
// +----------------------------------------+
// end signature
