#include <bits/stdc++.h>

using namespace std;

int main() {
    int N;
    string s;cin>>N>>s;
    bool stop=false;
    for(auto c:s){
        if(!stop&&c=='o')continue;
        else {
            cout<<c;
            stop=true;
        }
    }
    cout<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇義群和李労洪労李和奏義覇覇覇覇覇覇|
// |覇義奏李汎せ火ビ丁ビせ允労和奏陽慶覇覇覇|
// |奏労山丁ヘㇸシ丁火ビビビせ允洪和群覇覇覇|
// |允ビㇵ・ミ丁ヘ一一シミミヘミ火汎和陽覇覇|
// |丁ㇸㇸ丁ヘ　丁丁ヘ一ㇸㇸㇵミ火丁允和陽覇|
// |シ　ㇵシ・ビ丁一・ㇸㇸシミミヘミせせ労群|
// |一・ㇵㇵシ山シ　シ・ミせ火ミビせ山せビ汎|
// |ヘヘ一　ビせㇵ一ㇵ一火洪李汎火一ヘミミビ|
// |允允せシせ丁　ミ・ミ汎耗義耗汎丁　・・・|
// |労汎ㇵビミ一シ一シ山労労和奏汎丁　ビ丁ㇵ|
// |丁一丁ㇵ・ㇵㇵヘ山汎洪洪汎汎せㇵㇵビ山ヘ|
// |ㇸミ一ㇵ・ミ　丁洪山火丁ミ丁ビシ　シ山ヘ|
// |　ヘㇵ火一ヘㇸシ火シㇸ　・・　一シ　ミヘ|
// |・ㇸシ山ビㇸシ・シ　ㇵミビビビシㇸ一・シ|
// |ビㇸ・ビ汎火ㇵ一ㇵ一丁山洪労洪せ丁シㇸㇸ|
// |火　ヘ・丁允せヘ　シ山労奏李山ミㇸ・一一|
// |丁　ビヘ一丁山ヘ一火労群耗汎丁　ヘビせ火|
// |ㇸシ允ビシㇵミ・ビ労陽奏汎ミ　丁允李和洪|
// |ㇵ山李汎せビ　丁洪群群洪丁　丁洪奏慶陽労|
// |ミ汎奏耗允シ一せ李義耗山ヘㇵ山和慶覇群洪|
// +----------------------------------------+
// 2026 (April 11th) 22:01:32
// end signature
