#include <bits/stdc++.h>

using namespace std;

int main() {
    int N,X;cin>>N>>X;
    int prev=-1e9;
    for(int i=0;i<=N;i++){
        int v;cin>>v;
        if(abs(prev-v)>=X){
            printf("%d %d\n",i,v);
            prev=v;
        }
    }
}

// begin signature
// +----------------------------------------+
// |覇覇陽奏李労汎允允允汎労労李耗奏陽覇覇覇|
// |義奏李汎山火丁ミミ丁ビせせ山汎労耗群慶覇|
// |李汎火ミㇵㇸヘミヘㇵㇵヘシ丁火允労耗陽覇|
// |せミ一・シㇵ・・　・・　　一シ火允李奏慶|
// |ミㇸ・シ・ㇸㇸシ一・　・一ヘシヘビ允李群|
// |ヘ　ㇵ一ㇸ　シ・ㇸ・ㇸヘシシヘヘシミ山李|
// |シ・一・ㇵシㇵ・ㇵ・シ火せ山丁一ヘ火ミせ|
// |シ　一　ヘビ一一一一丁ミ一丁允ミ　一ビ火|
// |ㇵㇸㇵ一ビミ　シ　シ山ミミビ允ビシㇸヘ丁|
// |　・・火ビㇸヘㇸヘせ允せ汎洪汎允火シ　一|
// |・　せせㇵ一一ㇵせ労労和奏奏和労山ミ　ㇸ|
// |・丁汎丁・シ　ミ允和群義覇慶群李允ミ　ㇸ|
// |　ミ允ビ一ㇵㇸヘ火洪和奏群奏耗李汎ビ一　|
// |ㇸ・丁允丁ㇸㇵ・ㇵビ山汎洪洪李李山火火ミ|
// |ビ一・ミ山ビ一ㇸㇵ　ㇵミビ火火山山せビミ|
// |汎ビㇵ　ミせ火ヘ　ㇵ一・・一一ヘシ丁山火|
// |労山ミㇵㇸミせ火シㇸ　・・　・ヘ丁山汎火|
// |李允ビ丁ヘ一ミビ火丁シシシミビ山洪和汎允|
// |耗汎火ビビ丁ミミミ丁火山允汎労和奏奏和耗|
// |奏労允火汎允允允允汎労李和奏群陽群義耗義|
// +----------------------------------------+
// 2026 (April 11th) 22:03:43
// end signature
