#include <bits/stdc++.h>

using namespace std;

#define int long long
signed main() {
    int N;cin>>N;
    int best=0;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++)cin>>A[i];
    for(int i=0;i<(1<<N);i++){
        int pos=1,ans=0;
        for(int j=1;j<=N;j++){
            int d=A[j]*((i&(1<<(j-1)))?-1:1);
            if(pos>=1&&pos+d<=0)ans++;
            else if(pos<=0&&pos+d>=1)ans++;
            pos+=d;
        }
        best=max(best,ans);
    }
    cout<<best<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇慶群耗李洪汎汎允山山山允汎労耗群慶覇|
// |覇群和洪山火丁丁ミシヘヘシミビ山洪和奏群|
// |和洪せミㇵ一ㇵ・・ㇸ一ㇸ・・ヘ丁山洪洪洪|
// |山丁一ㇸ一・一・　ㇸㇸㇸ　ㇸ一ㇵビ丁ビ火|
// |ミㇸㇸㇸ・ㇸヘシ丁丁ミヘヘヘ一・・・一一|
// |ヘ・ヘ　ㇵ丁丁せ允洪汎山山山火ビシ一ㇸ　|
// |シ・ㇵㇸミ丁丁允李耗奏李允允允允允せミㇸ|
// |シ・一ヘ一・丁汎耗陽奏労李耗耗和耗和汎火|
// |ヘㇸㇵㇸ・一火労群奏耗李群群陽陽義陽和汎|
// |　ㇸ　ㇵㇵシ允耗群耗李労労労労和和和耗洪|
// |・・シㇸㇵビ洪李汎山せ火ビ火せ山山允洪允|
// |・ㇸ一ヘ丁汎汎せ丁ヘ一ㇸㇸㇵヘヘシミ火火|
// |　　・ヘせ汎ビヘ　ㇸヘシヘㇵ一一ㇸ　一ミ|
// |ㇸ・・シ山山ミ・ㇵ丁火山山山ビ火火丁ヘ・|
// |火一　ヘせ山シ　シせ汎李和労山丁ヘㇸㇸ一|
// |洪火ヘ　シせヘㇸビ汎和群耗洪ビㇵ　ㇵシヘ|
// |和汎ビヘ・シ・シ山李陽陽李せヘ・ミせ允山|
// |奏労山ビシ一ㇵせ李陽義和山シ・丁汎李和労|
// |陽和洪せシㇸビ洪群覇耗汎ミ　丁汎奏慶群労|
// |覇陽労火一ㇵせ李義義李せヘ一火労群義耗允|
// +----------------------------------------+
// 2026 (April 11th) 22:16:40
// end signature



