#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,M;cin>>N>>M;
    set<int>T;vector<int>C(M+1);
    bool uniq=true,one=true;
    for(int i=1;i<=N;i++){
        int f;cin>>f;
        if(T.find(f)!=T.end())uniq=false;
        T.insert(f);
        C[f]++;
    }
    for(int i=1;i<=M;i++){
        if(C[i]<1)one=false;
    }
    cout<<(uniq?"Yes\n":"No\n");
    cout<<(one?"Yes\n":"No\n");
}

// begin signature
// +----------------------------------------+
// |李洪汎允允汎汎允允山せせ山山汎労和群義覇|
// |せビ丁ミミ丁丁ミミヘヘヘシミビ山汎李群慶|
// |一・　　・ㇸ一　・ㇸㇸ・　ㇸヘ丁山洪耗義|
// |ヘシミミシㇵㇵシ丁シヘシミビビヘビ允李群|
// |せビミヘ一ヘ丁ㇵ・・ㇸ　　一シ火丁火汎和|
// |丁ㇵ・・一ビㇵ　ㇵ　一シミミシミ丁ビビ山|
// |ヘ・一ミビ丁一一ㇵㇸミ火山允山允山火丁シ|
// |一・一ビ允丁ㇸㇵ一一ビ允洪洪汎洪李李汎せ|
// |・ㇸヘせ山シ　シ　ミ山李耗奏奏和労汎允允|
// |　・丁汎ビㇸヘ・シ山李群覇慶群耗李洪せ丁|
// |・シ山せㇵ一一ㇵせ労群覇陽奏李汎せ火ビヘ|
// |・丁汎ビㇸヘ　シ山李奏義覇義奏労せシ一ㇵ|
// |　ミ山火ㇵ一一一ビ允労耗奏耗群耗汎ビㇸ・|
// |ㇸ・丁允ビ一一ㇵㇸシ火允洪汎洪労労允ビ一|
// |ビ一　ミ山火ヘ　ヘㇸㇸシ丁ビ丁火火火山ビ|
// |汎ビㇵ　シ火せミㇸ・ㇵㇸ　ㇸㇸ一ヘビ允汎|
// |李允ビㇵ・シ火シ丁ヘㇸ・・ㇸㇵミ火汎李洪|
// |耗洪せ丁ヘㇸシビ火火丁丁丁ビせ允労耗和労|
// |奏李汎山火丁ミミミ丁火山汎労洪耗陽耗李群|
// |陽奏和労允丁ミ山允汎允山李洪労群群義陽覇|
// +----------------------------------------+
// 2026 (April 18th) 22:03:37
// end signature
