#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,M;cin>>N>>M;
    vector<vector<int>>g(N+1);
    vector<int>vis(N+1,false);
    for(int i=1;i<=M;i++){
        int u,v;cin>>u>>v;
        g[u].push_back(v);
    }
    int ans=0;
    function<void(int)> dfs=[&](int u){
        ans++;
        for(auto e:g[u]){
            if(!vis[e])vis[e]=true,dfs(e);
        }
    };
    vis[1]=true;
    dfs(1);
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せ火火ビビビビ火せ山汎労和奏|
// |和労允せビミシヘヘㇵ一ㇵㇵシミビせ允洪李|
// |汎せ丁ヘ一ㇸㇸ　・ㇸㇸ・　・ㇵシビせ允労|
// |ビシㇸ・・・一　　ㇸ一一ㇸ・　一ヘ丁せ汎|
// |ヘ・ㇸ　一　・ㇵシㇵㇸ・　　・ㇸ　ㇵ丁せ|
// |ㇵ　一・ㇸ・ヘㇵ一　・一ㇸ・ㇸ・・・ㇸシ|
// |ㇵ　一ㇸ・一ヘシㇵ一一一一・　・・ㇵ一　|
// |ヘ　・ㇸヘミ丁ヘシ丁丁ビ丁ミヘ一　ㇸ・ㇵ|
// |一ㇸㇵシ丁丁シ丁せ山允允允山火丁ヘ　一・|
// |一ミビミㇵ丁せ允洪労洪労労洪允火ミ一・　|
// |丁せシシ火允洪允山せせ允汎允火ミヘ一・　|
// |せミシ火汎允火丁火山允允山ビシ一　・・　|
// |せシミ山汎火ミ火汎労李李洪山火丁ヘㇸㇸ・|
// |ミミミせ允ビビ山洪和群群耗労汎山火ミㇵ　|
// |ㇸㇵヘビ允火火允労和群奏李洪山ビミシシヘ|
// |ㇵㇸㇸミ山山せ洪和群義奏労允火シ一・　　|
// |シミミミせ山汎李群義群和汎火シㇸ・ㇵヘヘ|
// |せ山火丁山允李群慶陽和汎火シ　ㇵミ火火ビ|
// |労洪せビ允労奏慶義耗洪せシ　ヘビ允汎允火|
// |和汎火火汎和陽覇群李允丁一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (April 18th) 22:09:45
// end signature
