#include <bits/stdc++.h>
using namespace std;

void solve(){
    int N,A,B;cin>>N>>A>>B;
    if(N&1||!((A+B)&1)){cout<<"No\n";return;}
    string s;
    int x=(A&1?A:A-1);
    for(int i=1;i<x;i+=2){
        s+=string(N-1,'R');
        s+='D';
        s+=string(N-1,'L');
        s+='D';
    }
    if(A==x){
        if(B==N){
            s+='D';
            for(int i=1;i<=(N-2)/2;i++)s+="RURD";
            s+='R';
        }else{
            s+='D';
            for(int i=1;i<=(B-2)/2;i++)s+="RURD";
            s+="RRURD";
            for(int i=1;i<=(N-B-1)/2;i++)s+="RURD";
        }
    }else{
        if(B==1){
            s+="RD";
            for(int i=1;i<=(N-2)/2;i++)s+="RURD";
        }else{
            s+='D';
            for(int i=1;i<=B/2-1;i++)s+="RURD";
            s+="RURRD";
            for(int i=1;i<=(N-B)/2;i++)s+="RURD";
        }
    }
    for(int i=x+2;i<N;i+=2){
        s+='D';
        s+=string(N-1,'L');
        s+='D';
        s+=string(N-1,'R');
    }
    cout<<"Yes\n"<<s<<"\n";
}

int main(){
    cin.tie(0)->sync_with_stdio(0);
    cout.tie(0)->sync_with_stdio(0);
    int T;cin>>T;
    while(T--)solve();
}

// begin signature
// +----------------------------------------+
// |覇覇義奏和労ㇸミビ火ビ丁シㇵㇸせ山允洪李|
// |慶奏李汎ヘせ汎洪洪允火丁シㇵ一ㇸ　丁火允|
// |和汎ㇵ允和耗労山ビヘㇸㇸ・・ㇸ・　一シ丁|
// |山火和陽和汎火ヘ　一ヘヘ一ㇵㇸ　　　　・|
// |丁和陽和汎火ヘ　　ㇸ一ㇸ　　一シ丁丁ミシ|
// |せ群群労山丁ㇸ　一ㇵㇵ一　ㇵ丁せ允汎汎允|
// |ビ群群労せシ　ㇵ丁火せ火丁ヘ　ヘ火山汎和|
// |火奏群労火ヘㇸ丁山山火丁ビ火丁ㇸㇵ火せ山|
// |労義耗汎丁・シ火火ミシビせせビシ　シせ允|
// |群奏労火一ㇵㇵ一ㇵヘㇵㇵヘヘ一一・ヘ山洪|
// |義和允シ・ㇵㇸㇸㇸ・　ㇸ・・　ヘ　丁汎洪|
// |和允丁・ヘㇸ・ㇵ一・・・一　一ㇵ一火労李|
// |和允シ　　ㇵㇸㇸ一・　　ㇸ・ㇸ・ㇵせ允洪|
// |奏労火一一ㇸ一ㇸㇸㇵㇸㇸ・　ㇸ・一シミ丁|
// |ミ耗洪ビㇵ　ヘ・シシ丁ビビ丁ヘシミシヘ・|
// |　ビ和山シ・一一シ火允洪洪汎山ミ一　・　|
// |　　允せヘ一　ミせ洪和群和允ミㇸ一ミ丁丁|
// |　　火丁　・ミせ労群義和允ミ　シせ汎汎山|
// |　・ヘㇵㇸビ火労群慶耗汎丁　ミ允李奏和汎|
// |一ㇸㇸ一シ丁允耗慶陽李せヘ一ビ洪耗奏洪山|
// +----------------------------------------+
// 2026 (April 18th) 23:04:35
// end signature

