#include "island.h"
#include <bits/stdc++.h>
using namespace std;
void solve(int N, int L) {
    vector<int>order(N+1);
    for(int i=1;i<=N-1;i++){
        order[i]=query(1,i);
    }
    vector<bool>seen(N+1);
    seen[1]=true;
    for(int i=1;i<=N-1;i++){
        int u=order[i];
        if(seen[u])continue;
        seen[u]=true;
        for(int j=1;j<=N-1;j++){
            int v=query(u,j);
            answer(u,v);
            if(seen[v])break;
            seen[v]=true;
        }
    }
}

// begin signature
// +----------------------------------------+
// |覇義群和労汎允山山山允汎労和奏義覇覇覇覇|
// |群和労允せビミシシミ丁火山洪和奏群群群陽|
// |労允ビシㇵ・ㇵシ丁丁丁ミビ山労労労労李和|
// |火ミ一　ヘ丁せ山允允山山火火せせせせ山汎|
// |シ・・シ火允允せビ丁ミシヘシシヘヘシミビ|
// |ヘ　一丁山山ビ山李李李労李汎火ヘㇸ・　ㇸ|
// |　・ㇸヘビ火洪和洪允山せせ山允せ火シ　ヘ|
// |シミヘㇸㇸミ山洪山せ允山せ丁ㇵ　シ一ㇸ一|
// |山山せミㇸㇵビせ允労和李労山丁一一ヘシヘ|
// |李労允丁ㇸㇵビ汎和李陽群和汎ビ一ㇸ・　ㇵ|
// |群労せシ・ミ允和労群覇陽李山ミ丁丁ミ一・|
// |李允丁ㇸㇵ火洪耗李陽覇奏労せ允汎允火シ　|
// |允火シ　シせ洪耗李奏陽耗洪労李耗李汎ビ一|
// |丁ミ一・シせ洪耗群和耗陽奏和李陽群李允ミ|
// |・・　ㇵ丁山洪耗陽義群耗耗奏群和和労洪火|
// |ヘヘ一・シせ汎李耗群陽陽群耗労労洪労汎火|
// |せせミ一ㇸミ火允洪労李李労汎山せ洪労せシ|
// |労允火シ一一ミビせ山山山火火允李耗汎山火|
// |和洪山火丁シヘヘシシ丁火允労耗群労李労山|
// |群和労汎山せせせせ山汎労和群義耗耗群李山|
// +----------------------------------------+
// 2026 (May 24th) 18:23:49
// end signature
