#include "boxes.h"
#include <bits/stdc++.h>
using namespace std;
long long delivery(int N, int K, int L, int p[]) {
#define int long long
    vector<int>r(N+1),l(N+2),P(N+1);
    for(int i=1;i<=N;i++)P[i]=p[i-1];
    for(int i=1;i<=N;i++)r[i]=r[max(i-K,0ll)]+2*P[i];
    for(int i=N;i>=1;i--)l[i]=l[min<int>(i+K,N+1)]+2*(L-P[i]);
    int ans=1ull<<60;
    for(int i=0;i<=N;i++)ans=min(ans,l[i+1]+r[i]);
    for(int i=0;i<=N;i++)ans=min(ans,l[min<int>(N+1,i+K+1)]+r[i]+L);
    return ans;
}

// begin signature
// +----------------------------------------+
// |和労汎山せ火ビ丁丁丁丁丁丁丁ビ火山允洪李|
// |汎山火ビミシヘㇵㇵㇵㇵㇵㇵヘシ丁ビせ允洪|
// |せ丁シㇵㇸ・ㇸ・　　　　　ㇸ一ヘミ火山汎|
// |ミㇵ・　ㇸ　ㇸ一ㇵㇵ一ㇸㇸ・　一ヘ丁火允|
// |ㇵ・・　ㇸㇵヘ一・　・ㇸ・・　　ㇸヘ丁せ|
// |一　ㇸ・ㇵヘㇸ　ㇸㇵヘシシヘヘ一・・ヘ丁|
// |一　　ㇸヘㇵ・・・・ㇸ一ヘシ丁ミヘㇵ・ㇵ|
// |一　　ㇵミ一・ㇸ一・　・ㇸㇸㇵシミㇵ　・|
// |ㇸ・ㇸシヘㇵㇵㇸ　ㇸㇵㇵヘシシシシヘ・ㇸ|
// |　・シヘシ一　一一一一ㇵㇵヘシシミㇵ　・|
// |・ヘシㇵ　　・・・・　・ㇸ・ㇸㇸ一ㇸㇸ　|
// |ヘシㇸㇸㇵヘヘシヘヘ一ㇸㇸ一ㇸ・　　・ㇸ|
// |ミㇵ一シミ丁ビビビ丁ミシシミシヘㇵㇸ　ㇸ|
// |ミ一シ丁火せ山允允山せ火火火火火丁ミヘㇸ|
// |シㇵミビ山允洪労労労洪允山山ビ丁シヘヘヘ|
// |ヘヘ丁せ允洪李和耗耗和労允火丁ヘ一・　　|
// |ヘシ火允洪和奏群陽奏李汎せ丁ヘㇸ　一ㇵ一|
// |シビ允洪和群義義奏李汎せ丁ヘ　ㇸヘミ丁シ|
// |ビ山洪和群慶慶群和洪山丁ヘ　一ミ火せ火丁|
// |せ汎李奏義覇陽耗労允火シㇸㇸシ火允汎せ丁|
// +----------------------------------------+
// 2026 (August 31st) 20:13:58
// end signature
