#include <bits/stdc++.h>
using namespace std;
int main() {
    int R,C;cin>>R>>C;
    vector<vector<int>>M(R+1,vector<int>(C+1));
    for(int i=1;i<=R;i++){
        string S;cin>>S;
        for(int j=1;j<=C;j++){
            M[i][j]=S[j-1]-'a';
        }
    }
    vector<set<int>>ne(26);
    for(int i=1;i<=R;i++){
        for(int j=1;j<=C;j++){
            if(i>1)ne[M[i][j]].insert(M[i-1][j]);
            if(i<R)ne[M[i][j]].insert(M[i+1][j]);
            if(j>1)ne[M[i][j]].insert(M[i][j-1]);
            if(j<C)ne[M[i][j]].insert(M[i][j+1]);
        }
    }
    int ans=0;
    for(int i=0;i<26;i++){
        ans=max(ans,(int)ranges::count_if(ne[i],[&](int v){return v!=i;}));
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |シヘ一一ㇸ一ㇵヘミミミミヘㇵ一一ㇵㇵシミ|
// |　・ㇸ一一ㇸ・　一ㇸ・・　・ㇸㇸ・　・ㇵ|
// |シミ丁丁丁ミヘ一一ㇸ一ㇸㇸㇸ一一一ㇵㇸ　|
// |せ山允允せ丁ヘ一　ㇸ一ㇸㇸㇸ一一ㇸ　・一|
// |洪労允火ミㇵ　ㇸ　・・　　・・・　一一　|
// |和汎せ丁ㇵ　一・ㇵ　一ヘシシヘㇸ・一　ㇵ|
// |和汎せミ一・・一一・シ丁火せ火丁ヘ・一一|
// |和汎火シ・一・ㇵ・一シミ丁火丁ヘㇸ　　ㇸ|
// |労山丁一・一　ㇵ　　　・一ヘ丁ㇵ　一シシ|
// |允ビㇵ・・一ㇵ　一ㇵ一一一ㇵヘ一ㇸ・ヘビ|
// |火ヘ　一一ㇸㇸ一　　ㇸㇸㇸ・　ㇸㇵ　ヘビ|
// |ミ・ㇵミ・ㇵ・一ヘミミ丁ミシヘㇸ　　ヘ火|
// |ミ・ㇵシ・ㇸヘ丁火せ山山山せビミㇵ　ㇵビ|
// |丁一ㇸㇵ　ㇵ丁せ允洪労労労洪汎山火シ一シ|
// |ビㇵ　ㇵ・ヘビ山洪李耗奏和洪山火丁ミシヘ|
// |火ヘ　　ㇸミせ汎李奏陽奏李允火ミㇵㇸ・・|
// |ビㇵㇸ　ㇵビ允李奏義群和汎火ミ一・一ヘㇵ|
// |シ　ㇸ一丁允李奏慶陽和汎火シ・一ミビビ丁|
// |ㇸ一ㇸ丁山労奏慶義耗洪せシ　ㇵビ山汎允火|
// |　　ヘ火汎和陽覇群李允丁一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (June 11th) 15:10:03
// end signature
