#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++)cin>>A[i];
    priority_queue<int,vector<int>,greater<int>>pq;
    long long ans=0;
    for(int i=1;i<=N;i++){
        pq.push(A[i]);
        pq.push(A[i]);
        ans+=A[i]-pq.top();
        pq.pop();
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せ火火火ビビビ火せ山汎労和耗|
// |和労允せビミシヘヘヘㇵㇵヘシミビせ允洪洪|
// |汎せ丁ヘ一ㇸ一・　・・・　・ㇵシビせせせ|
// |ビシㇸ・一　一ㇸ　　・　　　・一シシシミ|
// |ヘ・・ㇸㇸ一　一・　・　　ㇸ・　・ㇸ・ㇸ|
// |ㇵ　一　ㇵ　　・一　・一ヘヘヘㇵㇸ　・　|
// |ㇵ　一　一ㇵヘシㇵ・・一ヘヘヘミ丁シ一　|
// |ヘ　・ㇸヘ丁シ一ㇸㇸヘシミビ火火ビビビヘ|
// |一ㇸ一シ丁ヘㇸヘ　ヘ丁ミミヘミ丁火せ火ビ|
// |　一一一一　ㇵ　ヘㇵㇸ・・・一ㇵシ丁火火|
// |　・ㇵ・一ㇸㇸ・・一ㇵㇵㇵ一ㇸ　ㇸヘ丁ビ|
// |・・・ヘ・ㇵㇸヘミ丁ビビビ丁シㇵ・ㇸヘ丁|
// |　　ㇵㇵ　ㇵミビせ允允汎允山せ丁シㇸ　ㇵ|
// |・・ヘ一・シビ山汎労李和和労汎山せ丁ㇵ・|
// |ㇸㇸ　一ㇸミ火汎労耗奏奏李汎山ビミシヘシ|
// |ㇵ・一　一ミせ洪和群義耗労允ビシ一・　　|
// |ㇵ・ヘ　ヘ火汎李群慶群李汎火シㇸㇸㇵシヘ|
// |・ㇵ・ㇵビ允李群慶陽和汎火シ　ㇵ丁火火ビ|
// |ㇸ一一丁山労奏慶義耗洪火シ　ヘビ允洪允火|
// |ㇵ　ヘ火汎和陽覇群李允丁一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (July 28th) 21:35:56
// end signature
