#include <bits/stdc++.h>
using namespace std;
int main() {
    int H,W;cin>>H>>W;
    if(W*10000/H/H>=25)cout<<"Yes\n";
    else cout<<"No\n";
}

// begin signature
// +----------------------------------------+
// |奏和労汎允せ火火ビ火火せ山汎労和耗奏耗耗|
// |李汎山火丁ミシヘヘヘシ丁火せ允洪労労労労|
// |山火ミヘ一・一ヘシシシヘミビせ山山山山山|
// |丁ヘㇸ　一シ一シ丁丁シㇵ　シ丁丁丁丁丁ビ|
// |ヘ・　ㇵミ允李耗耗李洪允ビシ・ㇵ一一一ㇵ|
// |ㇵ　ㇸビ労群覇慶陽奏和労洪山丁ヘ・ㇸㇸ・|
// |ㇵ　ㇵ汎群慶義陽群耗李汎山せビ丁ヘシミシ|
// |ㇵ　ビ和慶陽奏耗和李洪山火丁ミミ丁火せせ|
// |　ㇵ労義群耗李労汎允允せ山せビビせ允汎洪|
// |シ労義奏和労允山火山汎洪洪允せ允洪李和和|
// |労陽耗労汎せビ火允労耗耗李汎允李耗和耗耗|
// |群耗労允火ミビ允労奏陽群和汎労労洪洪洪労|
// |群李汎せミㇵビ山労奏群耗李汎允山せせせ山|
// |耗和汎せミㇸシ火允労和和洪允火ビミミミ丁|
// |汎耗労山丁一・ヘビ山汎洪汎せビシㇵㇸㇸ一|
// |ビ李李允ビㇵ　　ヘ丁火せせ火ミ一　ㇸ一ㇸ|
// |ミ洪労允ビㇵ　ㇸ・ㇵシミミミㇵ　ㇵシミミ|
// |ビ洪洪せミ一ㇸㇵ・　ㇸ一ㇸ一　ヘビせ山火|
// |火洪汎火シㇸㇸㇵヘ一ㇸㇸㇸ・ヘビ允洪汎火|
// |丁汎汎せミ一　一ヘヘㇵㇸ　ヘミせ洪労允ビ|
// +----------------------------------------+
// 2026 (July 18th) 20:03:20
// end signature
