#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    int a=0,b=0;
    for(int i=1;i<=N;i++){
        int x,y;string s;cin>>x>>y>>s;
        a+=y-x;
        if(s=="take")b+=y-x;
    }
    cout<<a-b<<endl;;
}

// begin signature
// +----------------------------------------+
// |覇覇慶陽耗李労洪汎洪労労労李和奏陽覇覇覇|
// |覇陽和洪允火ビ丁丁丁火火火せ允労和群慶覇|
// |耗洪せ丁ヘㇸシシㇵㇸㇸㇸㇵシビ山洪耗陽覇|
// |允丁一ㇸミ一　ㇸ　・　・一　ㇵ丁山労奏慶|
// |丁ㇸㇸシ　一ㇸシ一・　　ㇸ　一ㇸミ山李群|
// |シ　ㇵ一一　シ・一・一シミシㇵ　　ヘせ労|
// |シ・ㇵㇸヘ　ヘ・ヘ・ミせ允汎允山ビ一一ビ|
// |ミ・一・シ　一ㇵㇵ一ビ汎和奏奏和和汎ビ一|
// |ヘ一ヘㇸ一ヘ　ミ　ミ允和陽奏和労汎允山丁|
// |ㇵ一　ヘ火ㇸシㇸシ山李義慶陽耗労允丁ミミ|
// |・ㇸシ山ヘ一一ヘ山和義群和洪允山山ビヘ一|
// |ㇸㇸ労ビ・シ　丁汎奏和汎せ丁シヘㇵヘミミ|
// |　ヘ汎せㇵㇵㇸヘせ労汎ビヘ・・一ㇵ一　ㇸ|
// |ㇸㇸビ洪ビㇸヘㇸㇵビせシ　ㇵ丁火せせビシ|
// |一　・丁允火ㇵㇸヘ　ㇵヘ・ミせ山ビミシミ|
// |ㇸㇸヘ　ミ山せシ　ㇵヘ・一火山丁一　・・|
// |火火火ヘㇸミせビ一　　・ミ允丁・ㇵ丁ビビ|
// |労労允ビシ一ミㇸㇵビㇸシ山ミ　シ山洪労允|
// |陽和労允火ビㇵシ丁ヘ一せ丁　ミ汎耗群奏洪|
// |慶奏奏和洪ビㇸ火火ㇸシせㇵㇵせ李義覇奏汎|
// +----------------------------------------+
// 2026 (July 18th) 20:06:06
// end signature
