#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,M;cin>>N>>M;
    vector<int>A(N+1),B(N);
    for(int i=1;i<=N;i++)cin>>A[i];
    for(int i=1;i<=N-1;i++)cin>>B[i];
    int ans=1e9;
    for(int first=0;first<=1;first++) {
        vector<int>flip(N+1);
        flip[1]=first;
        for(int i=1;i<=N-1;i++){
            flip[i+1]=B[i]^A[i]^A[i+1]^flip[i];
        }
        ans=min(ans,accumulate(flip.begin(),flip.end(),0));
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |覇慶群耗李洪汎允せ火ビビ火せ山汎労耗群群|
// |陽耗労允せビ丁ミヘ一一一ㇵシ丁火允労労労|
// |李允火ミㇵ一・・一ㇵ一一ㇸ　一ミ火せせ山|
// |せミ一ㇸ　一ㇸ　ㇸ一ㇵ一一ㇵㇵㇵヘヘヘシ|
// |ミ・ㇸ　ㇵ　ㇵ一　・ㇸ　　ㇸシㇵ一ㇵㇸㇸ|
// |ヘ　一一・ㇵㇵ・ヘ　一シミミミミミヘ　ㇸ|
// |ヘ・一一　ヘㇸ一ㇵㇸミ火山允山允允山丁ㇵ|
// |シ・一一　シ　ヘㇸ一ビ允洪李和李和和汎火|
// |ㇵㇸ・ㇵㇸ一　ヘ・ミビビ火せ允汎労和和汎|
// |　・一　ヘ・ヘ　ヘヘミミミミ丁火山洪李洪|
// |・　ㇸヘ　一一ㇸ　　・　ㇸㇵㇵシビ山労汎|
// |・一　ヘㇸヘ・ヘミシシヘㇵ　一ミ火火汎汎|
// |　ㇸ　一・一ヘ火允せ山せ火ミ一ㇸヘシ丁せ|
// |ㇸ・一　・・一ビ洪洪李李労允ビヘ一・・ㇵ|
// |ビ一　一一　ㇸ丁允李奏陽群和洪せビ丁ミㇵ|
// |汎ビㇵ　ㇸㇸ・丁允和義慶奏労山丁ヘㇸ　・|
// |労山丁ㇵ一一一ビ洪奏覇陽李允丁一・ヘシシ|
// |和允ミ　・　シ山李陽陽李允ミ・ㇵビせ山火|
// |洪火一一一ㇸ丁允和義和允ミ　シせ洪李労山|
// |允ミ　一一ㇵせ労群群労火ㇵ一火洪奏陽李山|
// +----------------------------------------+
// 2026 (July 18th) 20:10:57
// end signature
