#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    int T;cin>>T;
    while(T--){
        int px,py,qx,qy,rx,ry,sx,sy;
        cin>>px>>py>>qx>>qy>>rx>>ry>>sx>>sy;
        int m1p=-(px-qx),m1q=(py-qy);
        int m2p=-(rx-sx),m2q=(ry-sy);
        bool same=(px+qx-rx-sx)*(qx-px)
                 +(py+qy-ry-sy)*(qy-py)==0;
        if(m1q==0||m2q==0){
            if(m1q==m2q)cout<<(same?"Yes\n":"No\n");
            else cout<<"Yes\n";
            continue;
        }
        if(m1q*m2p==m1p*m2q)cout<<(same?"Yes\n":"No\n");
        else cout<<"Yes\n";
    }
}

// begin signature
// +----------------------------------------+
// |火ビ丁ミミミミミミシヘヘヘシミ丁ビ火火せ|
// |ミヘㇵㇵ一一ㇵㇵ一ㇸㇸㇸㇸ一ㇵヘシミミ丁|
// |一・　　　　　　・ㇸㇸ・・　・一一ㇵヘシ|
// |・一一ㇵㇵ一ㇸ・ㇸㇸㇸ・　・・　　・ㇸㇵ|
// |ヘシミミミミシㇵㇸ　ㇸㇸ・　　・　　　・|
// |ミビ火火火火ビ丁シㇵㇵㇵ一ㇸ　・・　　ㇸ|
// |丁火山允允允山せ火丁ミミミシㇵヘヘヘㇵㇸ|
// |火山汎洪労労洪汎允山允山せビ丁ミ丁丁丁シ|
// |せ汎労李和耗和李洪汎允允允山火火せせ火ビ|
// |汎労和奏群群奏和労洪洪労洪允せ允汎汎山山|
// |労耗群義義陽奏和洪汎李和洪山允労労汎汎允|
// |和奏義覇慶陽耗和洪洪李労汎山汎汎允允允汎|
// |李奏陽義義群耗労汎洪和労汎せ山せ火火火せ|
// |洪李耗群群奏耗李洪汎李洪允せビビ丁ミミ丁|
// |山汎労和奏群群奏和労洪汎山火丁シヘㇵㇵㇵ|
// |せ允労耗群義義義群和労汎せビシㇵㇸ・　　|
// |せ汎李耗陽慶慶陽奏李洪山ビミㇵ・　ㇸ一一|
// |允洪和奏義覇義奏和洪允火ミㇵ　ㇸヘシミシ|
// |汎労和奏陽陽群和労允火ミㇵ　一シビ火ビミ|
// |汎労李耗奏奏耗李洪山ビシㇸ・ヘ丁せ山火ミ|
// +----------------------------------------+
// 2026 (July 18th) 20:18:00
// end signature
