#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    cin.tie(0)->sync_with_stdio(0);
    int N,C;cin>>N>>C;
    if(N<=1)return cout<<0<<endl,0;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++)cin>>A[i];
    int lo=-A[1],hi=A[1];
    vector<int>dp(N+1);
    int mx=0;
    for(int i=2;i<=N;i++){
        dp[i]=max(A[i]-C+lo,hi-A[i]-C);
        lo=max(lo,-A[i]+mx);
        hi=max(hi,A[i]+mx);
        mx=max(mx,dp[i]);
    }
    cout<<*max_element(dp.begin()+2,dp.end())+C<<endl;
}

// begin signature
// +----------------------------------------+
// |労汎允山山山允洪汎允山山山允允允汎洪労和|
// |ビシヘㇵㇵヘミ丁ミヘㇵㇵヘミシシミ丁火允|
// |　一ㇵㇵㇵㇸ　ㇸㇸ・　一ㇸㇸㇸㇸ　ㇸヘビ|
// |火せ山山せビシㇵㇵ一ヘミㇵㇸ　　・一　ㇵ|
// |労和和和李洪山丁ㇵ一　・ㇵヘ一一一一ㇸ・|
// |群義慶義耗汎火ヘ　ㇵミビ火火ビミㇵ　　一|
// |覇覇覇陽和允ミ・ㇵビミシミ丁火允山ビヘ　|
// |覇覇覇群労せヘ・ヘ丁ビビミㇵㇸヘ火汎允丁|
// |覇覇慶和允シ　ミせ汎労労汎せシ　一ビ汎允|
// |覇覇耗允ミ・丁汎和耗労洪李汎丁・　ミ允洪|
// |慶耗汎ミ・ビ洪群李允允允洪汎ミ・　ミ允汎|
// |耗允丁・ミ汎奏奏和耗奏耗李汎火シ　ミシミ|
// |労火一ㇵ火洪奏陽陽耗耗奏洪せミ一　ㇸㇸ・|
// |労ビㇸヘ山李陽群耗和和労允丁ㇸ一ミビ火火|
// |李せㇵㇵせ李陽義慶陽奏労山シ　ミせビビ火|
// |和山ヘ　ミ山労奏義覇義李せヘ一ビシㇸ　・|
// |李せ一ヘ・ミせ洪李耗奏洪丁　ミ一ㇸシ丁ミ|
// |汎ミㇸ火シ一ミ火山允允火一シ・ヘせ汎汎山|
// |火ㇸミ汎せビ丁丁丁火山ヘㇵ・ミ允和群耗洪|
// |丁　丁洪李洪洪洪労労火ㇸヘㇵせ和慶覇群洪|
// +----------------------------------------+
// 2026 (August 16th) 15:14:52
// end signature
