#include <bits/stdc++.h>
using namespace std;
int main() {
    int a,b;cin>>a>>b;
    if(a<=0&&b>=0||a==0||b==0)return cout<<"Zero\n",0;
    if(a<0&&b<0)cout<<((a-b+1)%2==0?"Positive":"Negative")<<endl;
    else cout<<"Positive"<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せせ火せせせ山山汎洪李耗群義|
// |耗労允せビ丁シ　一ヘヘㇵㇸ丁火山汎労和群|
// |汎せ丁シ　ミせ山山山せビミヘㇸビせ汎労和|
// |ビシ　ビ汎労李洪允せ火ビ丁シㇵㇸビ山允洪|
// |ヘ一山李耗労汎せビビミㇵ一一一ㇸ・ミ火山|
// |ㇵ丁労奏李汎労和奏奏和労山丁ㇵㇸ　　ㇵミ|
// |ㇵビ和奏李和陽義義陽陽耗李洪山丁ㇵㇸ・　|
// |ㇵせ耗奏和義陽奏耗和和李洪允せ火ミㇵ一　|
// |一洪群和義群耗李洪汎洪李李労允火ビビ丁ヘ|
// |山奏耗陽耗李汎山允労耗群奏和洪山汎允せミ|
// |耗群群和洪山ビ山労奏慶慶群李汎李李洪せシ|
// |奏群李汎火ミ火汎和陽覇義奏労李耗和汎火ヘ|
// |陽耗洪山丁ㇵビ允労耗群奏和汎労洪汎允ビㇵ|
// |奏奏労山ミㇸㇵビ山洪李李労允せ山火火丁ㇵ|
// |洪群李允ビㇵ・一ミ火山允允せビ丁シヘヘ一|
// |せ奏和汎火ヘ　ㇸ・ヘミ丁丁丁シ一ㇸ　　　|
// |火耗和汎火ヘ　シ一　ㇸ一一ㇸ　ㇸㇸヘシシ|
// |允奏李允ビㇵ・ㇵシㇵ一ㇸㇸㇵシ丁丁せせビ|
// |洪耗労山丁一・・一ㇵㇵㇵ一ㇵヘ火允洪汎せ|
// |洪奏労山ビヘ　・ㇸ・・ㇸ　一丁山李耗洪火|
// +----------------------------------------+
// 2026 (May 18th) 15:45:50
// end signature
