#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,M;cin>>N>>M;
    vector<int>cnt(N+1,1),good(N+1,0);
    good[1]=true;
    for(int i=1;i<=M;i++){
        int x,y;cin>>x>>y;
        if(good[x]){
            good[y]=true;
        } 
        if(--cnt[x]<=0)good[x]=false;
        cnt[y]++;
    }
    int ans=0;
    for(int i=1;i<=N;i++)ans+=!!good[i];
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せ火火ビビビビ火せ山汎労耗群|
// |和労允せビミシヘヘㇵ一ㇵㇵシミビせ汎労耗|
// |汎せ丁ヘ一ㇸㇸ　・ㇸㇸ・　・ㇵシビ山洪和|
// |ビシㇸ・・・一ㇵシヘㇵㇵヘミ一ㇵミ火汎李|
// |ヘ・ㇸ　一ヘシ一　　・　　ㇸヘミㇵミせ汎|
// |ㇵ　一・ヘミ一　一　ㇸヘシシヘヘシシミビ|
// |ㇵ　一ㇸ丁シㇸㇸ一・ヘシ丁火火火火ミシ一|
// |ヘ　ㇸ・ㇵㇸ　一ㇸ・　　ㇸㇵミビ火火ビ丁|
// |一ㇸ・ㇸ・一ヘシヘㇸ・ㇸㇸㇸ一ㇵシミ火山|
// |　・　一一一ㇵㇸ　・一一ㇵ一ㇸ　・ㇵミ火|
// |　一一一一ㇸㇸ一シミ丁ビビ丁シヘㇸ・ヘ丁|
// |・シ丁ヘ　ㇵシビせ山允允允山火丁ヘㇸㇸシ|
// |　ヘシ・一ミ火允洪労李李李洪允山ビシ・ㇸ|
// |・・ヘ　ヘビ山洪李耗群和労允火丁シシシㇸ|
// |ㇸㇸ　　ㇵビ允労耗群陽和洪せ丁ヘㇸ　　・|
// |ㇵ・一　ヘビ允李奏義群和汎火シㇸ・ㇵヘヘ|
// |ㇵ・ㇵ・シせ洪耗陽慶奏労山丁一・シビ火ビ|
// |・ㇵ・ヘビ汎和陽覇群李允ビㇵ・シせ汎汎山|
// |ㇸ一一丁允李群慶陽和汎火ヘ　シせ洪和労山|
// |ㇵ・ヘビ汎和陽覇群李允丁一ㇸミ山洪労允ビ|
// +----------------------------------------+
// 2026 (May 18th) 15:57:34
// end signature

