#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,L;cin>>N>>L;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++)cin>>A[i];
    auto it=max_element(A.begin(),A.end());
    if(*it>=L){
        int pos=it-A.begin();
        cout<<"Possible"<<endl;
        for(int i=1;i<pos;i++){
            cout<<i<<endl;
        }
        for(int i=N-1;i>=pos;i--){
            cout<<i<<endl;
        }
        return 0;
    }
    for(int i=1;i<=N-1;i++){
        if(A[i]+A[i+1]>=L){
            cout<<"Possible"<<endl;
            for(int j=1;j<i;j++){
                cout<<j<<endl;
            }
            for(int j=N-1;j>=i+1;j--){
                cout<<j<<endl;
            }
            cout<<i<<endl;
            return 0;
        }
    }
    cout<<"Impossible\n"<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇義群耗李労汎山せせ山允洪李奏義覇覇|
// |覇慶奏李汎せビ丁シㇵ一一ヘミビ山労和耗奏|
// |奏労山丁ヘㇵㇵ丁ビビ丁ヘ一　ㇵ丁せ山允汎|
// |汎ビㇵ・せ労和和労允火ミㇵㇸ　一ㇵヘシミ|
// |丁ㇸ丁和義覇陽李允ビヘシミシㇵ・ㇸㇸ　ㇵ|
// |シㇸ李覇覇義耗・シ　ㇵ丁ビビㇵビシ・一一|
// |ミシ奏覇義耗一ㇵㇵ一丁允洪労洪汎ビ・・ミ|
// |ミビ義覇群火ㇸシ一ㇵせ労奏陽陽奏李山シ　|
// |ヘ李覇陽山ミ・ミ・ビ洪奏和労洪汎允山せヘ|
// |洪覇陽労火ㇸミ・丁洪労洪山ビせ汎李和労丁|
// |覇・洪允ヘㇵㇵヘ允耗陽耗洪火せせ山和和ミ|
// |義火李火ㇸシ・ミ汎奏義陽李せミㇵせ山汎ヘ|
// |　丁洪山ヘ一ヘ一火洪耗労允ビミヘㇵヘシミ|
// |ㇸ・ビ洪せヘ一ヘ・ミ山允丁ㇵ　一ヘヘ一　|
// |奏ㇵ　丁汎允ミ　シ一ㇸミシ　シビ山火火火|
// |ビ丁ヘ　ミ山汎ビㇵ・ヘ一　ㇵ火火シ一・ㇸ|
// |ㇵ丁せシ・ミ山汎ビヘ一ㇸㇸ火火ㇵㇸシ丁ミ|
// |ヘ汎汎火シ一ミシ　ヘシ一火ビㇸヘせ汎洪允|
// |一和李汎山火ヘ一火允せビビ・ミ汎耗群奏洪|
// |覇労群和労ビ　丁洪耗山允ヘㇵ山和慶覇群洪|
// +----------------------------------------+
// 2026 (May 18th) 16:03:42
// end signature
