#include <bits/stdc++.h>
using namespace std;
int main() {
    string s;cin>>s;
    int N;cin>>N;
    for(int i=N;i<s.size()-N;i++)cout<<s[i];cout<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇慶群耗李労労労李耗群義覇覇覇覇覇覇|
// |覇慶群李汎山火ビビ火せ允労李耗群慶覇覇覇|
// |群李允ビヘㇸシ丁火ビ丁ビ火山汎李群慶覇覇|
// |汎ビㇵ・ミビシ一　　　　一シビ允李群覇覇|
// |ビㇸ・丁シ・一シㇵㇸ・ㇸㇵㇸㇸミ山李群覇|
// |シ　ㇵミ・ㇵㇵ一　ㇸㇸ・ㇸㇸ　ㇸㇵ火洪奏|
// |ミ・ㇵシ・シㇵ　シ　ミ火丁ヘ　ㇵ　　ミ允|
// |ミ・一ㇵ一ㇵ・一ヘ一火洪労允ビ一・ㇸ・シ|
// |ヘ一シ　シヘ・ミ・ミ汎奏陽耗汎丁　　　ㇸ|
// |　ㇸㇸミヘㇸシ一ヘ允耗陽群群洪丁シヘㇸㇸ|
// |・一シヘ　ㇵㇵヘ山耗李洪汎汎汎汎允せミシ|
// |ㇸㇸヘヘ・ミ　ビ洪山ビミシミ丁火允労山丁|
// |　ㇸㇵシ一シ・ミビヘ・・一ㇸ　ㇸシせ洪允|
// |ㇸㇸミㇵ　・シ　ヘ　シビせせ火丁ㇵ・ミ允|
// |せㇵ　シㇸㇵ一ㇵ一ㇵ火汎労和洪せ丁シ一ㇵ|
// |李せヘㇵㇵ　ミヘ・ミ允和群和山ミ・ㇸㇵㇵ|
// |奏汎ミ・ヘ　ㇵヘㇵせ李陽奏汎ミ　シ火山せ|
// |耗允シ・一ㇸヘㇸ火李義群洪ミ　丁汎和耗労|
// |耗允シ・ㇵ一　丁洪陽陽労丁　ビ労陽覇義李|
// |奏汎ビㇸㇵ・一せ和慶奏允ヘㇵ山耗覇覇陽洪|
// +----------------------------------------+
// 2026 (May 16th) 22:01:37
// end signature
