#include <bits/stdc++.h>
using namespace std;
int main() {
    int R,C;cin>>R>>C;
    vector<vector<int>>A(R+1,vector<int>(C+1,0));
    for(int i=1;i<=R;i++)
        for(int j=1;j<=C;j++)
        {
            auto g=[&](int i,int j){
                return (i>=1&&i<=R&&j>=1&&j<=C);
            };
            A[i][j]=g(i-1,j)+g(i,j-1)+g(i+1,j)+g(i,j+1);
        }
    for(int i=1;i<=R;i++){
        for(int j=1;j<=C;j++)
            cout<<A[i][j]<<" ";
        cout<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |火丁シヘヘシミビせせ火火ビ丁ミミミ丁火山|
// |ㇸ　ㇸ一ㇸ・　一シㇵ一ㇵ・　・・　・ㇵミ|
// |ミビ火火ビ丁シㇸ一ㇵㇵヘミ丁丁丁ミヘ・ㇸ|
// |汎洪労労山丁ㇵ　・・ㇸ・ㇵ丁山汎山火シㇸ|
// |耗群労山ミ・ㇸ一シ丁ビ丁シ一丁允李洪せミ|
// |義群労火ヘ・・ミシヘㇵ一ㇵヘシミ允和和汎|
// |覇陽李せヘㇸ・ㇵㇵㇸㇵ一一ㇵㇸ　シ山和奏|
// |覇義和山シ・　ヘ一　一ㇵヘㇵ一　　丁汎和|
// |覇陽李山ヘ・・シヘ丁火ビビ火火丁ヘヘビ汎|
// |群李山ミㇸ・シ丁シㇵㇸㇸㇸ一ヘミビㇵミ山|
// |労火ㇵ一・ミㇵ　一ヘシシヘ一　一シシミ山|
// |せㇵ一・ヘヘ・シせ山山山せビシㇸㇸミシ山|
// |丁・一ヘ　一ㇵ一ビ允李和李洪山丁ㇵㇸヘ火|
// |火一・一一ㇵ一ㇵ・シ火汎洪洪洪洪せシ・一|
// |山シ　　一ビシ　ヘ一ㇸシ丁ビビ火せ火ミㇸ|
// |汎丁　　ㇵ火山ミ一・ㇵㇸ　ㇸㇸ一シ火允ミ|
// |汎丁　・・シ火山ビシ一ㇸ・一ヘ丁せ洪洪せ|
// |山シㇸㇵヘ一シビせせビビビ火山洪和耗李洪|
// |丁一ㇵビ火丁ミミ丁ビせ允労李耗群群義奏洪|
// |ㇸ一ㇵせ洪汎允允汎洪李耗群義慶慶群義耗允|
// +----------------------------------------+
// 2026 (May 16th) 22:09:22
// end signature

