#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    string S;cin>>S;int N=S.size();
    int ans=0;
    for(int i=0;i<N;i++){
        if(S[i]=='C')ans+=min(i+1,N-i);
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せせ火火せ山山允允允允汎洪労|
// |和労允せビミシシヘシミ丁丁丁丁丁ビ火せ允|
// |汎せ丁ヘ一・ㇵヘ一ㇸㇸㇸ一一一ㇵヘシ丁火|
// |ビシㇸ・ㇸ　　・・一ㇵヘシシヘㇵ・ㇸヘ丁|
// |ヘ・・・一ヘ・一ㇵヘヘヘシミミミシㇵ　ㇵ|
// |ㇵ　ㇸヘミ・一一ㇸㇸㇸ・　・一ヘミ丁ミ一|
// |ㇵ　ㇵ丁ビ・ㇸㇸヘミミミシ一　ㇸ　一シミ|
// |ㇸㇸシ火丁・　ヘシヘ一ㇸㇸㇸㇸ・一一　ㇵ|
// |　ヘ丁丁・　一ㇵ・　ㇸ一ㇵㇵ一・　一ㇵ　|
// |一一一　　ㇸ・ㇸヘミ丁ビビビ丁シㇵ・・　|
// |　・　・・ㇸヘ丁火山允允允山せビミ一　ㇵ|
// |・　・　一ミ火允洪労李和李労汎山ビシㇸ一|
// |　　ㇸㇸミ火汎労耗奏群和洪山火丁ミシヘ　|
// |・・・一ミせ洪和群義奏労允火ミㇵㇸ・・一|
// |ㇸㇸ　・ミせ洪和陽慶奏李允ビヘ・ㇸㇵヘㇵ|
// |ㇵ・一　シせ洪耗陽慶奏李允丁ㇵ・ヘミ丁ビ|
// |一　　ㇸミ山労奏慶義耗洪せミ・ㇵ丁せ山允|
// |一シ・ヘ火汎和陽覇群李允丁一ㇸ丁山労李汎|
// |一ヘㇸ丁山労奏慶陽耗汎火ヘ　シ火汎李洪せ|
// |・ヘㇵビ允李群慶群和汎ビヘ　シビ山允せ丁|
// +----------------------------------------+
// 2026 (May 16th) 23:28:00
// end signature

