#include <bits/stdc++.h>
#include <bits/extc++.h>
using namespace std;
using namespace __gnu_pbds;
using otree=tree<int,null_type,less_equal<int>,rb_tree_tag, tree_order_statistics_node_update>;
int main() {
    int X,Q;cin>>X>>Q;
    otree s;s.insert(X);
    while(Q--){
        int a,b;cin>>a>>b;
        s.insert(a);s.insert(b);
        cout<<*s.find_by_order(s.size()/2)<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |耗李洪允山火ビビビビビ火山允洪李耗群義覇|
// |労允せビ丁シヘヘㇵヘシミビせ允洪李耗群義|
// |山ビミヘ一・一ㇵヘシシヘミビせ汎労和奏陽|
// |ミヘㇸ　一シ丁ミシシシミミミ火山汎労和奏|
// |ㇵ・　ㇵミシㇵ一ㇸㇸㇸ一ㇵヘミビせ汎労和|
// |一　ㇸシヘ一　・ㇸ一ㇸㇸ・　ㇸヘミ火山洪|
// |一　ㇸシ一　ㇸ・　・・・・・ㇸㇸㇸヘ丁せ|
// |ㇵ　・ヘ・ㇸ・・　　ㇸ・・　　ㇸㇵヘㇵミ|
// |一・一ㇸ・・　ㇸㇸ一ヘシシヘㇵ・・ㇵㇵヘ|
// |　・ㇸㇸ　ㇸ・一ヘ丁ビ火火丁シㇵ・　　ㇸ|
// |　ㇸㇸ　ㇸ　ㇵミ火山允汎山火丁ヘヘヘ一　|
// |・・・ㇸㇵヘミ火允労李労汎山ビ火ビ丁シㇸ|
// |・ㇸ一シ丁ビ火山洪和奏耗労允山允山せビヘ|
// |ㇵㇸヘ丁火山允允汎李奏和洪允せ火ビ丁ビビ|
// |丁丁ヘビせ汎労李李労李李汎山ビミシㇵㇵヘ|
// |火せ丁ビ山洪和耗奏耗和労允せ丁ヘㇸ　　　|
// |ビ火ミせ汎李奏陽義群和汎山丁ヘ・ㇸㇵヘヘ|
// |シヘビ允労奏義覇群和洪山丁ㇵ　一ヘシビ丁|
// |ㇵ丁山洪和群慶陽耗労山ビヘ　一ヘ丁せ山ビ|
// |ㇵ丁山洪和群陽群和汎せミㇸㇸミビ山汎山丁|
// +----------------------------------------+
// 2026 (May 16th) 22:19:27
// end signature
