#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    int N;cin>>N;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++){int v;cin>>v;A[i]+=v;};
    for(int i=1;i<=N;i++){int v;cin>>v;A[i]-=v;};
    vector<int>M;int B=0;for(int i=1;i<=N;i++){B+=A[i];M.push_back(B);}
    sort(M.begin(),M.end());
    int med=M[N/2];
    int ans=0;for(auto v:M)ans+=abs(v-med);
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和洪汎山せ火火ビビ丁ビビ火山汎労和和|
// |和労允せビミシヘヘㇵ一一ㇵヘミ丁せ允汎汎|
// |汎せ丁ヘ一ㇸ一　・ㇸㇸㇸ　　一シ丁火火火|
// |ビシㇸㇸㇸ　一・　・ㇸ・・ㇸㇸ一ヘヘヘシ|
// |ヘ・ㇸ・ㇸㇸ・ㇵㇸㇸ一ㇵㇵㇵ・　　ㇸ　　|
// |ㇵ　一　一　ㇵㇸヘミ丁ビビ丁ミヘ一・　ㇸ|
// |ㇵ　一　一・一ヘ丁ビビ火ビ火ビビ丁ヘㇸㇸ|
// |ヘ　ㇸ　一ㇸ一ㇵㇵㇵㇵヘミミ丁火せ火ミ一|
// |一ㇸ一ㇸ　・　・ㇸㇸ　　・ㇵㇵヘミビ火シ|
// |　・　一ㇸ一一・・　・ㇸㇸㇸ　　一ヘ丁ミ|
// |　・ㇵ・　・　ㇸㇵシミミミミヘ一　ㇸシシ|
// |・・ㇸ一　ㇸヘ丁火せ山山山せビミㇵ　一ㇵ|
// |　・ヘ　ㇸシビ山汎洪労労労洪允せ丁ヘ　ㇵ|
// |ㇵシㇵ　ㇵ丁せ汎労和奏耗労允せビ丁ミシㇸ|
// |シビヘ　ㇵ丁山洪和群陽耗洪山ビシㇵㇸ・ㇸ|
// |ミせシ　ㇵビ允労奏陽陽和汎せミ一　一ㇵㇵ|
// |火火ヘ　シせ洪和陽慶奏労山丁ㇵ　ヘ丁ビ丁|
// |山ミ・ㇵビ汎和群覇群李允ビㇵ・シ火允允せ|
// |ビㇵ一丁山李群慶陽和汎火ヘ　シ火洪和洪せ|
// |ミㇸヘ火汎和陽覇群李允丁一ㇸ丁山労李汎火|
// +----------------------------------------+
// 2026 (June 8th) 14:08:23
// end signature

