#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    vector A(N+1,vector<int>(N+1));
    for(int i=1;i<=N;i++)
        for(int j=1;j<=N;j++)
            cin>>A[i][j];
    vector B(N+1,vector<int>(N+1));
    int map[5]={-1,3,1,4,2};
    for(int i=1;i<=N;i++){
        for(int j=1;j<=N;j++){
            cout<<map[A[i][j]]<<" ";
        }
        cout<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |覇覇慶群耗李洪汎汎允山山山允汎労耗群慶慶|
// |覇群和洪山火ビ丁ミシヘヘシミビ山洪和和和|
// |和洪せ丁ㇵ一ㇵ　・一一一・・ㇵ丁山山山允|
// |山丁一ㇸ一・ヘㇸ　ㇸ一ㇸ　ㇸ　ㇵシヘシミ|
// |ミㇸㇸㇸ一一・ㇵ・・ㇸ　　一・ㇸㇸㇸㇸ　|
// |ヘ・ㇵ　ヘ　ヘ　ヘ　　ヘㇵ一一ㇵミ丁丁丁|
// |シ・ㇵ　ㇵㇸ一一ㇵㇸㇸミ火せ丁ビヘㇸ　　|
// |シ・一・ㇵ一ㇸヘ一・ヘビ火山汎せシ　ㇸ　|
// |ヘㇸㇵㇵ・ヘ　シ　一ㇸㇸ一ヘビ山ビ一ヘㇸ|
// |　ㇸ　ㇵ・ㇵシ・一ヘシシㇵ　ㇵビビㇸㇵ　|
// |・・シㇸ一一一ヘせ允允せ丁ㇵㇸシシ　　ㇵ|
// |・ㇸ・シㇸシ　ミ允和李洪せシ一　・ヘ　ミ|
// |　　　丁ㇵ一一ㇵビ汎労労洪允火シ　ㇵ　丁|
// |ㇸ・ㇸヘミ一一ㇵㇸミせ汎労労労允丁ヘ　ミ|
// |火一　　丁ビヘ　シㇸㇸシビ火ビせせ火シヘ|
// |洪火ヘ　ㇵ火山ミㇸㇸヘㇸ　ㇸㇸ一ヘ火せヘ|
// |和汎ビヘ・ミせ山丁ヘ一・・ㇸㇵミせ洪允ミ|
// |奏労山ビヘ一ミビせ火ビ丁ビ火山汎李和汎山|
// |奏和洪山火ビミミ丁ビせ允洪李耗群群奏和汎|
// |洪洪洪洪労汎汎汎汎労李奏群義慶慶陽慶耗汎|
// +----------------------------------------+
// 2026 (July 19th) 20:32:49
// end signature
