#include <bits/stdc++.h>
using namespace std;
int main() {
    int T;cin>>T;
    set<int>lose;
    for(int i=2;i<=2e5;i=2*(i+1))lose.insert(i);
    while(T--){
        int N;cin>>N;
        vector<int>D;
        int c=0;
        for(int i=1;i<=N;i++){
            int v;cin>>v;
            if(v)c++;
            else if(c) D.push_back(c),c=0;
        }
        if(c)D.push_back(c);
        int lc=0;
        for(auto v:D)if(v==2)lc++;
        if(lc==D.size())cout<<"Bob\n";
        else cout<<"Alice\n";
    }
}

// begin signature
// +----------------------------------------+
// |李労李李労汎允山せ火ビビビ火せ允洪李奏陽|
// |山山山允火丁ミシヘㇵ一一ㇵヘミビせ汎李奏|
// |シシミシㇵㇸㇸ　ㇸ一一一ㇸ　ㇸシビ山労耗|
// |　　ㇸㇸㇸㇸ一　・一一一・　・ㇸシ火汎和|
// |ヘ一・　一・ㇸ　　・ㇸ・　ㇸㇸㇸㇸミせ洪|
// |　　ㇵ・一　ㇸヘミビ火　シ・　ㇸ　・シせ|
// |ㇵㇵ一・一一ヘミ一ㇸシビビシ一・　・　ヘ|
// |火火ビㇸ一丁　シ火允汎允火ミ・ㇵヘシㇵㇸ|
// |せ山せミ一丁洪耗陽義慶義奏労山ビせせ火丁|
// |李労允ビ労群覇慶義陽陽群耗李汎洪労労汎せ|
// |群労汎群覇陽奏耗和李李労允洪和奏群耗洪せ|
// |耗李慶義奏李洪汎李耗李允汎耗奏耗和和労せ|
// |李陽義奏労允せ洪奏義耗汎洪和労汎允允汎山|
// |汎義陽和洪せミ山労耗耗洪山洪允火ビ丁丁火|
// |せ陽陽和汎火シシせ汎洪汎せせ火ミㇵㇸㇸ一|
// |ビ群義和汎ビㇵ　ヘ丁火火丁シ丁ㇵ　一ヘㇵ|
// |允陽群李山ミㇸㇸ　一ㇵㇵㇸㇸヘ　シビ火火|
// |耗義和汎ビㇸ一・・一ㇸ一ヘ・・ミせ洪洪允|
// |義奏洪火ヘ・　ㇸ一ㇸ・・ㇸ　ミ山李奏和允|
// |義耗汎ビ一　ヘㇵㇸㇸㇸ一ㇵㇵビ汎和奏労せ|
// +----------------------------------------+
// 2026 (July 19th) 21:00:08
// end signature

