#include <bits/stdc++.h>

using namespace std;
#define int long long
signed main() {
    int N;cin>>N;
    if(N==1) return cout<<1<<endl,0;
    int k=N+1;
    for (int i=N-1;i>=2;i--){
        k=k+(k-1)/(i-1);
    }
    cout<<k<<endl;
}

// begin signature
// +----------------------------------------+
// |ぼぼぼぼゑおなずぞずなぜおゐゑぼぼぼぼぼ|
// |ぼぼゐなチパいㇸㇱㇷㇷㇱㇳ　ぞなぜおゑぼ|
// |ゑずスャㇳいチゴゴスうこㇷㇸㇸうパゴなゐ|
// |チャㇳスぜゐおぞパこㇱㇸㇸ・・　ㇱャパぞ|
// |こㇱずぼぼぜチャㇸ　ノノㇸ・ㇸノ　・ㇱい|
// |ㇷスあぼゑずうㇱ　　ㇸㇸ　ㇸㇸ　　ノ　ㇸ|
// |っチぼぼおゴャㇳㇸ・ㇳㇸ　ノㇸ　ㇸㇳㇸ・|
// |っぞぼぼぜスㇷ　ㇸこいうャㇷㇸㇸㇳㇸ・ノ|
// |ㇸあぼゐゴこ・ㇷうぞななずスこㇸㇱ　ノ　|
// |ぜぼあぞこ　っチぜあおゑなぞうノㇸ　ノ・|
// |ぼぼずャ　こゴゑゑゐずスャㇷㇸノ　ノ　ㇱ|
// |ぼおパㇸㇸスおあぜチャㇸ　ノㇱㇱㇸㇸ　っ|
// |ぼおパㇸㇸスおなスャㇳノこうススうャㇱ　|
// |ぼあぞこ・ャずゴャっ　っパぞうっノㇳㇳㇱ|
// |なぼおスㇸㇸスパっノ　こチゴこㇳㇳㇱㇷㇱ|
// |ㇸゑぼずャ　こいㇳノㇷャぞチㇷ・っうスチ|
// |ゑぞぼなうㇳㇱㇷㇳいチチないㇳㇷスなおゐ|
// |ぼチぼずうノㇸ　こぞおぜスㇱノパぜぼぼあ|
// |ぼスゐずうㇸㇸㇳいチチぞこ　ャずあぼぼな|
// |ぼㇱぞぜチこノ　ㇸㇱスゴっ・ャぞおゐなパ|
// +----------------------------------------+
// end signature


