#include <bits/stdc++.h>

using namespace std;
#define int long long

signed main() {
    int N,K;cin>>N>>K;
    vector<int>V(N+1);
    for (int i=1;i<=N;i++)cin>>V[i];
    vector<int>pref(N+1);
    for(int i=1;i<=N;i++)
        pref[i]=pref[i-1]+V[i];
    multiset<int>e;
    e.insert(0);
    int ans=-(1ull<<60);
    for (int i=1;i<=N;i++){
        ans=max(ans,pref[i]-*e.begin());
        e.insert(pref[i]);
        if(i>=K){
            e.erase(e.find(pref[i-K]));
        }
    }
    cout<<ans<<endl;

}

// begin signature
// +----------------------------------------+
// |陽奏和洪汎山せ火火ビ丁丁ビ火せ山汎労和群|
// |和労允せビミシヘヘㇵ一一ㇵヘミビせ汎労耗|
// |汎せ丁ヘ一ㇸㇸ　・ㇸㇸ・　・ㇵシビ山洪労|
// |ビシㇸㇸ・・一　・・ㇸ・・一ㇵ一ミ火せ汎|
// |ヘ・ㇸ　一　・ㇸㇸㇸㇵヘヘヘㇵ一一ヘ丁火|
// |ㇵ　ㇸ・一ㇵ一　　　ㇸㇵシ丁ミミシ一ㇸヘ|
// |ㇵ　　ㇵシㇵ・　ㇸ一一一ㇵヘヘ丁火ビシ一|
// |ヘ　・シㇵ　ㇸヘミせ火ビビビビビ丁ビせ丁|
// |一ㇸㇵ一　ㇵミ火丁ミヘㇵㇵㇵヘシミビ火せ|
// |　ㇵㇸㇸシ火ミヘㇸ　　・・・　・一シ丁丁|
// |ヘ　ㇵ丁ミㇵ・・ㇵシミミミシヘ一　一シㇸ|
// |・ㇵビシㇸ・ヘミビせせ山せ火ビシㇵ　一ㇸ|
// |　ヘミㇸㇸシビせ允洪労労洪汎允せ丁ㇵ　一|
// |　　シ・一丁せ汎労和耗耗労汎せビ丁ミシ・|
// |ㇸㇸ　・ㇵ丁山洪和奏陽耗労山ビシㇵㇸㇸ一|
// |ㇵ・一　ㇵビ允労耗陽陽和洪せミ一　ㇸㇵ一|
// |ㇵ・ヘ　シ火汎和陽慶奏労允丁ㇵ　ヘミビ丁|
// |ㇸシ・ㇵビ汎和群覇群李允ビㇵ　シ火山允せ|
// |ㇸ一一丁山李群慶陽和汎火ヘ　シ火汎李洪せ|
// |ヘ　ヘ火汎和陽覇群李允丁一ㇸ丁山労李汎火|
// +----------------------------------------+
// 2026 (April 3rd) 21:55:36
// end signature



