#include <bits/stdc++.h>
#include <cstdio>
using namespace std;
#define int long long
signed main() {
    freopen("drivein.txt", "r", stdin);
    freopen("driveout.txt", "w", stdout);
    int N,MOD;cin>>N>>MOD;
    vector<int>dp(N+1);
    dp[0]=1%MOD;
    for(int i=1;i<=N;i++){
        dp[i]+=dp[i-1]*dp[i-1]; dp[i]+=MOD*MOD;dp[i]%=MOD;
        dp[i]+=1; dp[i]+=MOD*MOD;dp[i]%=MOD;
        if(i>1){
            int dp2=dp[i-2]*dp[i-2]%MOD;
            dp[i]+=dp2*dp[i-1]; dp[i]+=MOD*MOD;dp[i]%=MOD;
            dp[i]-=dp2*dp2; dp[i]+=MOD*MOD;dp[i]%=MOD;
       }
    }
    cout<<dp[N]<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇慶群耗李洪汎汎汎洪李李和奏陽慶覇覇覇|
// |覇群和洪山火ビ丁丁丁火せ山允洪李奏義覇覇|
// |耗洪せ丁ㇵ一シミヘㇵㇵヘシ丁せ汎李奏慶覇|
// |山丁一ㇸミㇵ　・ㇵㇵ一　　ㇸシ火汎和陽覇|
// |丁ㇸㇸシ・　ヘビせせ火丁ㇵㇵ一ヘビ汎和義|
// |シ・ㇵㇸ一一ビ允労李李労汎せミビ丁丁允和|
// |シ・ㇵ・・せ労奏陽陽群李允汎允允丁山ビせ|
// |シ・一　ビ労奏奏和李労洪汎洪洪労允ビ火山|
// |ヘ一ㇵビ労奏和李耗允火丁火労洪ビ丁丁ミ山|
// |　ㇸビ労和汎允耗耗洪山允労和山ヘ　　ミヘ|
// |・ミ允洪せ火洪奏和和和奏和允丁ㇸ一一ㇸ　|
// |・ビ汎ビビ洪奏陽奏和群李汎せビシ　一丁ㇸ|
// |　ミせ丁允李群覇奏李労山ビヘㇸ　・・ㇵ　|
// |ㇸ・丁汎洪耗義群耗和洪火ヘ　ㇵミビビ丁シ|
// |ビ一　ミ允和群李洪允山ビ一一丁火ミヘㇵヘ|
// |洪火ㇵ　ミ山労汎火ミビ丁・シせシ・ㇸㇵ一|
// |和汎丁ㇵ・ミせ火ㇵミせㇵ一火シ　シビせ火|
// |奏洪火丁ヘ一ミ一シ允シ・ビミ　丁允労李洪|
// |奏労せ山火丁ㇵㇵミ丁　ミミ　丁汎耗義奏洪|
// |陽和汎洪洪丁・ミ山ヘ一火ㇵㇵせ李陽慶耗汎|
// +----------------------------------------+
// 2026 (April 17th) 18:35:39
// end signature



