#include <algorithm>
#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    int N,K;cin>>N>>K;
    vector<int>A(N+1),ΣA(N+1);for(int i=1;i<=N;i++)cin>>A[i];
    for(int i=1;i<=N;i++)ΣA[i]=ΣA[i-1]+A[i];
    int lo=0,hi=ΣA[N]+1;
    while(lo+1<hi){
        int mid=(lo+hi)/2,cnt=0;
        for(int i=1;i<=N;i++){
            cnt+=upper_bound(ΣA.begin(),ΣA.begin()+i,ΣA[i]-mid)-ΣA.begin();
        }
        if(cnt>=K)lo=mid;
        else hi=mid;
        // printf("mid=%d, ans=%d\n",mid,cnt);
    }
    cout<<lo<<endl;
}

// begin signature
// +----------------------------------------+
// |覇陽奏和労汎允山山せ火火火せ允汎労耗群群|
// |群和洪允火丁ミシシヘㇵㇵヘミ丁せ允労労李|
// |洪山ビミㇵㇸ一　・ㇸㇸ・　ㇸヘ丁せ山山山|
// |火ミ一・ㇸ・ㇵ・　・・　　・ㇸㇵシシミ丁|
// |シㇸㇸ・一・ㇸ一一・ㇸㇵㇵㇵ一・　ㇸㇸㇸ|
// |ヘ　一・一ㇵヘ・ㇸヘ丁ビ火火ビ丁ヘㇸ・　|
// |ヘ　　ㇵミ丁ㇵ　ヘビせ火火せビシㇵㇸ　　|
// |ヘ　・シ火シㇸ一ヘ丁ビミヘ・ミビビミヘㇸ|
// |ㇵㇸㇵビ丁一せ洪和奏奏和汎火シㇸミ丁ミシ|
// |　一ビ丁山和陽慶義陽陽耗洪山ミㇵ・ㇸ　　|
// |ㇵビせ耗義陽奏耗和李李允山火ミヘ一　シシ|
// |丁汎陽義奏和洪汎汎李和和労山火シ　一山山|
// |せ奏義奏李汎せ汎和群義陽耗労せミ　・ㇸ汎|
// |允陽陽和洪せ丁允和陽覇陽耗労允火ミシㇵ一|
// |火奏陽和汎火シせ洪奏慶群和汎せミヘ一ㇸ一|
// |丁奏義和汎ビㇵミ允李群群李允丁ㇵ　一ㇵㇵ|
// |山陽群李山ミ・シせ洪和耗汎火ヘ　ヘ丁火ビ|
// |和義和汎ビㇸ　ヘビ允洪洪火ヘ・ミせ汎洪允|
// |義奏洪火ヘㇸ・一ビ允せせシ　ミ山労奏李允|
// |義耗汎ビ一一・ヘ火山せビㇵ一ビ汎和奏労せ|
// +----------------------------------------+
// 2026 (April 17th) 21:20:53
// end signature




