#include <bits/stdc++.h>

using namespace std;

int main() {
    string s;cin>>s;
    cout<<(s.length()%5==0?"Yes\n":"No\n");
}

// begin signature
// +----------------------------------------+
// |覇慶陽耗李洪汎允允允汎洪李耗陽慶覇覇覇覇|
// |義耗李汎せビ丁ミミ丁ビせ允労耗奏陽覇覇覇|
// |李允火ミㇵㇸㇵシミ丁丁ミ火允洪李耗陽覇覇|
// |せミ一　ヘ丁丁ミヘヘヘヘミビせ汎李奏義覇|
// |ミㇸ　シ丁ヘㇸ　ㇸㇸㇸ・　一シビ山労奏義|
// |ヘ　一丁ヘ　一ㇵㇸ・　　　ㇸ・ㇸシ火汎和|
// |ヘ　一ミㇸㇸㇵ　一　ヘミミヘ一　ㇸ一丁允|
// |シ　ㇸシ　ヘ・　ㇵㇸヘ丁火丁丁ミ一・・ミ|
// |ㇵ一ㇵㇸㇵㇸㇸヘヘㇵㇸㇸㇵ・・ㇸ一一ㇸㇵ|
// |　・一ㇵ・シビせせビシ　ㇵシシㇵ一　・ㇵ|
// |　一一一丁允労李洪山ミ丁せ山火火丁ㇵ・シ|
// |ㇸ・一丁允和群群李山丁允李労労汎火ヘ　ミ|
// |　・ㇸ丁汎耗慶義和允ビ洪奏和李労山シ　シ|
// |・ㇸヘㇵ火洪耗群和汎ビ火汎労汎せビ丁ㇸ一|
// |丁一　ㇵㇵビ允洪洪允ビㇵ丁火火丁ヘ一ㇸ　|
// |允ビㇵㇸ・一ミビ火ビシㇸ　一ㇵㇵ　一ヘヘ|
// |労山シ　ㇵㇸ・一ㇵ一ㇵ一ㇸㇸ　・シ火せ火|
// |李山ミ　ㇵㇸヘ一ㇵㇵㇸㇸㇸㇵシ丁山労労汎|
// |労山ミ・ㇵ　ヘシミ丁ビ丁ビせ丁允和群耗汎|
// |李允ビㇵ　一・ㇵミ丁丁丁シㇵビ洪耗群李和|
// +----------------------------------------+
// 2026 (April 3rd) 16:45:07
// end signature
