#include <bits/stdc++.h>

using namespace std;

int main() {
    int N,M;cin>>N>>M;
    vector<int>cnt(M+1);
    for (int i=1;i<=N;i++){
        int a,b;cin>>a>>b;
        cnt[a]--;cnt[b]++;
    }
    for (int i=1;i<=M;i++)
        cout<<cnt[i]<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇慶群耗李洪汎汎汎洪洪労李和奏陽覇覇覇|
// |覇群和洪山火ビ丁丁丁ビビ火せ允労和群慶覇|
// |和洪せ丁ㇵㇸシヘ一ㇸㇸㇸㇵシビ山洪耗陽覇|
// |山丁一ㇸシㇸ・ㇵㇵ一一ㇵㇸ　ㇵ丁山労群覇|
// |ミㇸㇸㇵ　ヘㇸ・一　　　ㇸヘㇵ一丁允李陽|
// |シ　ㇵ・ヘ・一・一・一ㇸ・・一シビシ山労|
// |シ・ㇵ　ヘ・ㇵㇸヘ・ミ火ビヘ・・ㇸ一ヘビ|
// |シ・一　一一一ㇵㇵ一ビ汎洪山丁ㇸ　一一　|
// |ヘ一ㇵㇵ　シ　ミ　ミ允汎山山山丁ミㇵ　シ|
// |　ㇸ　ㇵミㇸシ・シ山汎汎汎汎洪汎山丁一・|
// |・ヘビせㇵ一一ヘせ李耗奏耗奏奏和汎火ミ一|
// |ㇸビ洪ビ・シ　ミ允耗義覇慶陽耗労せビ火ミ|
// |　ミ允火ㇵㇵ一ヘせ洪和群陽群義奏洪せせビ|
// |ㇸ・丁汎ビ一ㇵㇸㇵビ山汎労労李和和洪允労|
// |ビ一・丁允火ㇵㇸヘ　ㇵミビ火火山允せ山李|
// |洪火ヘ　ミ山せシ・一ヘ・・一一ヘシビ汎和|
// |和汎ビヘㇸミせせミㇵ・　　　一シ火汎和陽|
// |奏労山ビヘ一ミ火せビ丁ミミ丁せ允労奏義覇|
// |群和洪允火丁ミミ丁ビせ允汎労和奏義覇覇覇|
// |義陽耗李洪汎汎汎汎洪李耗奏陽義覇覇覇覇覇|
// +----------------------------------------+
// 2026 (April 3rd) 16:46:54
// end signature
