#include <bits/stdc++.h>
#include <queue>

using namespace std;

int main() {
    int Q;cin>>Q;
    priority_queue<int,vector<int>,greater<int>> pq;
    for(int i=1;i<=Q;i++){
        int t,v;cin>>t>>v;
        if(t==1) pq.push(v); else while (!pq.empty()&&pq.top()<=v)pq.pop();
        cout<<pq.size()<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |覇覇陽奏李労汎允允允汎允汎洪労和奏陽慶覇|
// |義奏李汎山ビ丁ミミ丁丁丁丁ビせ允労耗陽覇|
// |李汎火ミㇵㇸヘㇵㇸ　　・ㇸㇵミ火允労奏義|
// |せミ一・ヘㇸ・　・ㇸㇵㇵ・・ㇸシ火汎和陽|
// |ミㇸ・ㇵ　・シシ一・　　ㇸヘ丁ㇸシ火洪耗|
// |ヘ　一・ㇸ火シ・ㇸㇸㇸヘシシㇵヘ丁ㇵビ汎|
// |シ・一ㇵミ火ㇵ・ヘ　シビせ山せせせビシ丁|
// |シ・一丁允ビ一一ㇵ一丁山労李山せ火丁ミヘ|
// |ㇵ一ヘせ允ミ　ミ　シせ労奏耗汎丁丁丁ミシ|
// |　・丁汎ビㇸヘ・ヘせ労群陽李允せミㇸ一　|
// |・シ山せㇵ一一ㇵせ労群陽奏耗李允丁ㇸ　ㇵ|
// |ㇸビ汎丁・シ　ミ允和陽慶覇陽耗汎ビヘ　ミ|
// |　ミ允火一ㇵㇸㇵ火汎李奏群奏群労せㇵヘミ|
// |ㇸㇸ丁汎丁ㇸㇵㇸㇵ丁せ汎労労李洪允火火ビ|
// |丁一・ミ允ビㇵㇸヘ　ㇵミビ火火山山せシシ|
// |允ビㇵ・ミせ火ヘ　ㇵㇵ　ㇸㇵㇵヘシ丁火ㇵ|
// |労山丁一ㇸミせ火シ一　・・　ㇸヘビ山山ミ|
// |和汎せミㇵㇵミ火火丁ミシシミビ山洪洪允允|
// |奏労汎せビミシヘシミビ山允汎労和李耗李耗|
// |義耗労洪汎山山山山汎洪李耗奏陽耗群義奏慶|
// +----------------------------------------+
// 2026 (April 3rd) 16:53:09
// end signature
