#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,L;cin>>N>>L;
    int l=1,r=L;
    while(N--){
        int a,b;cin>>a>>b;
        l=max(l,a);
        r=min(r,b);
    }
    cout<<max(0,r-l+1)<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏李洪汎山せ火火火せ山山允汎労李耗群義|
// |和洪允せビミシヘヘシミ丁丁ビせ山汎労耗群|
// |允せ丁ヘ一・ㇵヘ一一一一ㇵシ丁火山洪李奏|
// |ビシㇸ・ㇵ一　・ㇸ一一ㇸ　ㇸㇵミ火允労耗|
// |ヘ・・ㇵ　ㇸ一ㇸ　・　　・・・一ミ火允労|
// |ㇵ　一ㇸㇸㇵㇸ・ㇸ・ㇸㇸ・　一ㇵヘヘビ山|
// |ㇵ　ㇸ　一シㇸ　一ヘシミミシ一　一ミシミ|
// |ㇵ　ㇸ　ヘヘ・一ヘ丁火せ山せビシㇸ・ㇸ一|
// |一ㇸㇸ一ミㇵヘヘ丁せ汎洪労洪山ビヘㇵ一・|
// |　・一丁ㇵヘㇵ丁山洪和奏耗李汎火ビビ丁ヘ|
// |　ㇵビシヘ一ミ山労耗義義奏李允允汎山火ミ|
// |一丁ミ火シヘビ汎和陽覇義耗洪労和李洪山丁|
// |シビ丁丁ヘヘビ汎和陽慶陽耗労労汎汎允汎ビ|
// |せ丁丁ビ丁一ミ山労耗群奏李洪允せ火ビビ火|
// |汎山ミミヘ一ヘビ允李耗和労允せ丁シヘㇵヘ|
// |ビ火ミビシㇵヘビ山汎和労汎山丁ヘㇸ　・・|
// |ヘヘミ丁ミシシせ山山洪洪火ビヘ・一ヘミシ|
// |　ㇵビミミㇵビ允火火山山丁ヘ　ヘ丁せせ火|
// |　ヘ丁ヘシミ山山ミ火ビビヘ　ヘ火允洪汎火|
// |　ヘ丁ヘシ丁允火ヘミヘ一一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (May 16th) 23:57:04
// end signature
