#include <bits/stdc++.h>
#include <cstdio>
using namespace std;
int main() {
    freopen("shotin.txt", "r", stdin);
    freopen("shotout.txt", "w", stdout);
    int N;cin>>N;
    using pii=pair<int,int>;
    vector<pii>R(N+1);for(int i=1;i<=N;i++)cin>>R[i].first>>R[i].second;
    sort(R.begin()+1,R.end(),[](pii x,pii y){
        return x.second<y.second;
    });
    int ans=0,last=-1;
    for(int i=1;i<=N;i++){
        auto [l,r]=R[i];
        if(l>last)ans++,last=r;
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せ火火ビビ丁ビビせ山汎労和奏|
// |和労允せビミシヘヘㇵ一一ㇵヘミビせ允労和|
// |汎せ丁ヘ一・一　・ㇸㇸㇸ　　一シ丁せ汎李|
// |ビシㇸ・ㇸ　一・　・ㇸ・　・　一シビ允労|
// |ヘ・・・ㇸㇸ・一・　・　　ㇸㇸㇸㇸシ火汎|
// |ㇵ　一　一　ㇵ　一　ㇸㇵヘㇵ一一　・シ火|
// |ㇸ　ㇸ　一・　ㇸ一　　・ㇵシ丁ミヘㇸ　ヘ|
// |ㇸㇵㇵ一一一ヘシヘ　・一ㇵヘシシビミㇵ　|
// |ミビビミシㇵㇵヘ　　ㇸ　ㇸㇸ一ㇵシ丁丁ㇵ|
// |ビミㇵ・　・ㇵ　・　ㇸ一一一ㇸ　ㇸㇵミヘ|
// |一　一ヘ・ㇸㇸ一ヘミ丁丁丁ミシㇵ・・ヘㇵ|
// |・シ丁一・ㇵシビせ山允允山せ火丁ヘ・ㇸヘ|
// |　ヘ　ㇸ一ミ火山汎労李李李洪允山ビヘ・一|
// |・・・・ㇵ丁山洪李耗奏耗労允火丁ミシシㇸ|
// |ミㇸ　ㇸㇵビ山労耗群陽和洪山丁ヘ一・　・|
// |丁ミ一一ㇵビ允李奏義群和汎火シㇸ・ㇵヘヘ|
// |火ビㇵ・シせ洪耗陽慶奏労山丁一・シ丁火ビ|
// |せシㇸヘビ汎和陽覇群李允ビㇵ・シ火允汎山|
// |丁一一丁允李群慶陽和汎火ヘ　シせ洪和労山|
// |シ　ヘ火汎和陽覇群李允丁一ㇸミ山洪労汎ビ|
// +----------------------------------------+
// 2026 (April 17th) 19:32:18
// end signature



