#include <bits/stdc++.h>
using namespace std;
using ld=long double;
#define int long long
signed main() {
    int N;cin>>N;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++)cin>>A[i];
    vector<ld>H(N+1),d(N+1);
    const ld SCALE=1e5;
    for(int i=1;i<=N;i++)H[i]=H[i-1]+(ld)SCALE/i;
    d[1]=H[N];
    for(int i=2;i<=N;i++)d[i]=d[i-1]+H[N-i+1]-H[i-1];
    ld ans=0;
    
    for(int i=1;i<=N;i++)ans+=A[i]*d[i];
    ans*=2;ans/=N*(N+1);ans/=SCALE;
    if(abs(ans-round(ans))<1e-6L){
        ans=round(ans);
    }
    cout<<(int)(ans)<<endl;
}

// begin signature
// +----------------------------------------+
// |李洪汎山せビビ丁丁ミミミミ丁丁火せ山汎汎|
// |汎山火丁ミシヘㇵㇵ一一一一ㇵヘミビ火せせ|
// |火丁シㇵㇸ・ㇸ　　・・・　・一ヘミミミ丁|
// |ミㇵ・・ㇸ　ㇸ・　　・　・ㇸㇸㇸㇵ一ㇵㇵ|
// |ㇵ・・・・ㇸ　一ㇸ　　　　・ㇸ一・　　・|
// |一　ㇸ　一　一　・　　　　　・　・　　ㇸ|
// |一　ㇸ　ㇸ・・・　ㇸ一ㇵヘㇵ一ㇸ　ㇸㇵ一|
// |一　ㇸ　ㇸ　　ㇸㇸㇸ・　　ㇸㇵシヘㇸ　一|
// |ㇸ・ㇸㇸ・一ヘヘㇸㇸㇸㇸ一ㇸ・ヘシシ一　|
// |　・・ㇸㇸ一ㇵヘヘㇵㇵ一ㇸ一ㇵ一　ミㇵㇸ|
// |　ㇸ一ヘシシミミミミシㇵㇵㇵㇵㇵㇸ丁ヘ　|
// |ㇵシミ丁ビ火せせせ火ビミ丁シヘㇵㇸ　ヘ　|
// |シミビ火山允汎汎汎允山火丁ヘㇸ　　　　ㇸ|
// |ㇵ丁せ山汎洪労李李労洪允せビシ一ㇸㇸㇸ・|
// |ㇵ丁せ山洪李耗奏奏奏和労汎せビミヘヘヘヘ|
// |ㇵミせ允労和奏陽義群和洪允火丁ヘ一・　　|
// |ヘ丁山汎李奏陽慶陽耗李汎せ丁ヘㇸ　一ㇵ一|
// |ミ火汎李奏陽覇義奏李汎せ丁ㇵ　ㇸヘミミシ|
// |ビ允労耗陽慶義群和洪せ丁ㇵ　一ミ火せ火丁|
// |火允労耗陽慶陽耗労允火シㇸㇸシビ允汎せ丁|
// +----------------------------------------+
// 2026 (June 19th) 16:12:32
// end signature
