#include <bits/stdc++.h>
using namespace std;
int main() {
    int x,y;cin>>x>>y;
    using pt=complex<int>;
    pt p=pt(x,y),l=pt(0,0),d=pt(1,0);int s=0;
    for(int i=1;i<=10000;i++){
        for(int k=0;k<=1;k++){
            for(int j=1;j<=i;j++){
                if(p==l){
                    cout<<s<<endl;
                    return 0;
                }
                s++;
                l+=d;
            }
            d*=pt(0,1);
        }
    }
}

// begin signature
// +----------------------------------------+
// |覇覇陽耗李洪汎允允允山山山允洪李和和和奏|
// |義奏李汎せビ丁ミミシシシミ丁火山山允汎洪|
// |李汎火ミㇵㇸㇵ・　・・　　一シシシミビせ|
// |せミ一ㇸㇸ・一一ㇸ　　　　　・・　・ㇵミ|
// |ミㇸㇸ・　ヘミヘ一一一ㇸヘミ丁丁ミヘㇸ・|
// |ヘ　　一一ミ一　ㇵ　一一　ㇵ丁山允ビビシ|
// |ヘ・　ㇸ一ヘ　ㇸㇵㇸミ火丁ヘ　ヘ火洪せビ|
// |シ・　　シㇵㇸㇵ一一ビ允汎せミ・ヘ火洪山|
// |ㇵㇸ一一ミ　　シ　ミ山李耗洪せヘ・丁允汎|
// |　　一ビㇸㇸヘ・シ山李群群労せヘㇸビ洪允|
// |・ㇸビㇵ一一一ㇵせ労群慶耗汎丁・シせ汎せ|
// |ㇵミ丁ㇸㇸヘ　シ山李群群労せシ・一丁允丁|
// |ビせヘ　ㇵ一一一ビ允労耗李汎せミㇸㇵビ丁|
// |ミ火ㇵㇸミ一一一ㇸミ火允洪洪洪允ビ一一ビ|
// |・ミヘ・丁火ヘ　シ・ㇸシ丁ビビ火せ火ヘㇸ|
// |ヘ　ㇵ　シせせシㇸㇸヘㇸ　ㇸㇸ一ㇵビ火一|
// |ビシ・ㇵ・シ火せミㇵㇸ　　・ㇵシ火允せミ|
// |山丁ㇸ丁ヘㇸシビ火ビ丁ミ丁ビせ允労洪允せ|
// |允丁シ山火丁ミミミ丁火山汎洪李耗李和李允|
// |汎火ミ允汎允允允允汎労和奏群義奏群義和允|
// +----------------------------------------+
// 2026 (April 18th) 18:53:13
// end signature
