#include <bits/stdc++.h>

using namespace std;

int main() {
    int R,C;cin>>R>>C;
    vector<vector<int>>V(R+1,vector<int>(C+1));
    for (int i=1;i<=R;i++){
        for (int j=1;j<=C;j++){
            cin>>V[i][j];
        }
    }
    long long ans=0;
    for (int i=1;i<=R;i++){
        vector<int>dp(C+1,0);
        for (int j=2;j<=C;j++){
            dp[j]=max(dp[j-1],dp[j-2]+max(0,V[i][j-1]+V[i][j]));
        }
        ans+=dp[C];
    }
    for (int i=1;i<=C;i++){
        vector<int>dp(R+1,0);
        for (int j=2;j<=R;j++){
            dp[j]=max(dp[j-1],dp[j-2]+max(0,V[j-1][i]+V[j][i]));
        }
        ans+=dp[R];
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |シヘㇵ一一一ㇵシミ丁ミミシヘㇵㇵㇵヘシ丁|
// |　・ㇸ一一ㇸ　・一ㇸ・ㇸ　・ㇸㇸ・　ㇸㇵ|
// |シミ丁丁丁シヘㇸ一ㇸㇸヘシミミミシㇵㇸ　|
// |せ山允山山ビミヘ一ㇸ・・ㇸ一ヘミ火丁ヘㇸ|
// |洪労汎せ丁ヘシㇵ・・・　　・　一シビビシ|
// |和労允ビ丁ミㇵ・ㇵ　一ヘシシヘ一　一ミ火|
// |和洪山ビミヘ・一一・ヘ丁火せ火ビミ一　ヘ|
// |労允火ミㇵ・・ㇵ・一ミせ允允允汎山ビヘ　|
// |汎せミ一　ㇵ　ㇵ・シビビ丁丁ビ火ビ丁丁ㇵ|
// |火シ・ㇸシ・ㇵ　ヘヘㇵ一一一ㇵシㇵ一一ㇵ|
// |ㇵ　ヘ丁一ㇸㇸ一　・ㇸㇸㇸ・　・ㇵ　　ㇸ|
// |　ヘビミ・ㇵ　一ヘミ丁丁ミシヘㇸ　・一・|
// |　ヘビヘ・ㇸヘ丁火せ山山山せビミㇵ・・　|
// |・　シㇵ　ヘ丁せ允洪労李労労汎山火ミ一一|
// |　ㇸ　ㇵ・シビ允洪和耗奏和洪山火丁ミシヘ|
// |・ㇵ一　ㇸミせ汎李奏陽奏李允火ミㇵㇸ・・|
// |・ㇵシ　ㇵビ允李奏義群和汎火シㇸ・ㇵヘㇵ|
// |・シㇸ一丁允李奏慶陽和汎火シ・一ミビ火丁|
// |ヘ一ㇸ丁山労奏慶義耗洪せシ　ㇵビ山汎允火|
// |シ　ヘ火汎和陽覇群李允丁一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (April 3rd) 21:25:10
// end signature
