#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    int N,M;cin>>N>>M;
    const int INF=1e9+7;
    vector<int>A(N+1),W(M+1),ΣA(N+1),mxW(M+1,-INF);
    for(int i=1;i<=N;i++)cin>>A[i];
    for(int i=1;i<=M;i++)cin>>W[i];
    for(int i=1;i<=N;i++){
        ΣA[i]=ΣA[i-1]+A[i];
        for(int j=1;j<=M;j++){
            if(i>=W[j])mxW[j]=max(mxW[j],ΣA[i]-ΣA[i-W[j]]);
        }
    }
    int ans=ΣA[N];
    for(int i=1;i<=M;i++){
        if(mxW[i]>0)ans+=mxW[i];
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せ火ビ丁丁丁丁ビ火せ山汎労和|
// |和労允せビミシヘㇵ一ㇸㇸ一ㇵシミビせ允洪|
// |汎せ丁ヘ一ㇸ・・ㇸ一一一・　・一ヘ丁火せ|
// |ビシㇸㇸ　ㇸㇸ・一ヘシシㇵ一ㇸ　ㇸヘシミ|
// |ヘ・ㇸ　一　一シㇵㇸ・　　・一一一ㇸ　ㇸ|
// |ㇵ　ㇸㇸ・・ヘㇸㇵ　一ヘシシヘ一一一・ㇸ|
// |ㇵ　一ㇸ　ㇸㇵㇸ一・ヘ丁火火火ビ丁ヘㇸ　|
// |　　　ㇸ　ㇸ一ㇵㇸ一ヘシ丁ビせ允允せ丁ヘ|
// |シシヘ一・ㇵ　ㇵ・　・ㇸ一ヘミビせ山山丁|
// |せせ丁ヘㇸㇵヘシ・・・一一一ㇵヘミビせ火|
// |洪山丁ヘ丁ミㇸ　　・ㇸ一一ㇸ　・ㇵシビビ|
// |せミ丁丁　ㇵ・ㇵシミ丁丁丁ミヘ一　一ミビ|
// |ビ丁ビヘ　ㇸシ丁火山山允山せ火ミヘ・一ミ|
// |ビ火ビㇵ　ヘ丁せ允洪労李李労汎山火ミ一・|
// |丁ビビヘ・シ火允労和耗奏和洪山火丁シシヘ|
// |ヘビビヘㇸミせ汎李奏陽奏労允火ミㇵ・　・|
// |シせ丁一ヘビ允李奏義群和汎火シㇸ・ㇵヘㇵ|
// |ビ火ヘㇵ丁允李奏慶陽和汎火シ・一ミビ火丁|
// |せシㇸ丁山労奏慶義耗洪せシ　ヘビ山汎允火|
// |ビㇵヘ火汎和陽覇群李允丁一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (April 17th) 22:19:01
// end signature
