#include<bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    string S;cin>>S;
    vector<int>A(N+1,N);
    int c=0;
    for(int i=1;i<=N;i++){
        if(S[i-1]=='x'){
            A[++c]=i;
        }
    }
    for(int k=1;k<=N;k++)cout<<A[k]<<endl;
}

// begin signature
// +----------------------------------------+
// |洪洪洪労李李労洪汎洪汎汎汎洪李和耗奏群義|
// |丁丁ビ火山火ビ丁丁丁ミミ丁ビせ山允汎労和|
// |　・ㇸㇵヘ一シ一ㇵミビ火せ丁ヘシミビ山洪|
// |ミシヘㇸ・・ㇵ丁ビ丁ミミビせ允丁・ㇵミせ|
// |　　・・　一丁シㇸ　・　・ㇵ丁山ビ一・シ|
// |シ・ㇵㇸㇸヘシ　ㇵ・一シ丁丁シミ火丁ヘㇸ|
// |シ・ㇵㇵㇵㇵㇵㇸヘㇸミせ允汎汎允允山允ミ|
// |ミ・一火山ビ一ㇵㇵㇵ火汎和奏奏和耗耗労允|
// |ヘ一ヘ山汎ミ　ミ　ミ允山労奏李洪労奏群李|
// |　ㇸビ労火ㇸシ・シ允李労李和山汎洪李群李|
// |・ミ汎山ヘㇵ一ヘ山和陽陽耗李耗群群奏奏労|
// |ㇸビ労ビㇸシ　ミ汎耗義覇奏汎労李洪洪労耗|
// |　丁汎せㇵㇵ一ㇵ火洪和群群和汎せビ汎汎奏|
// |ㇸ・ビ汎火一ㇵ一一丁せ洪労労李労允允允汎|
// |火ㇵ　丁允せヘ・シ・一ミビ火火山山せシミ|
// |洪火ヘ　ミ山山ミ・一シㇸ・一一ㇵシビ山ヘ|
// |耗汎火ヘㇸミせ山丁ㇵ・　　・一ミ火汎允丁|
// |奏労允ビシ一ミ火山火丁丁丁ビせ汎李李洪允|
// |陽耗労允せビ丁ミ丁ビせ汎洪労和群耗群耗汎|
// |覇義奏和労洪汎汎洪労和奏群義慶群義覇奏汎|
// +----------------------------------------+
// 2026 (August 1st) 22:10:04
// end signature
