#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,K;cin>>N>>K;
    string S;cin>>S;
    vector<int>A;
    for(int i=1;i<=N;i++){
        if(S[i-1]=='o')A.push_back(i);
    }
    long double best=0;
    int i=1;
    for(auto it=A.begin(),it2=A.begin()+(K-1);it2!=A.end();it++,it2++){
        best=max(best,(long double)K/(*it2-*it+1));
    }
    cout<<setprecision(10)<<best<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇覇覇義群奏奏和李李和耗群義慶覇覇覇|
// |覇覇覇群李汎山せ火ビ丁丁ビせ汎洪労和奏義|
// |覇群労せミㇵヘ・火労労汎洪奏義奏洪せ汎和|
// |李せヘ一ㇵ一允洪山火ビビせ汎李陽群労ビ允|
// |せ一ㇵㇸシ李山ミㇸ・一　　ヘ火洪耗和汎ビ|
// |丁・ヘ一丁汎ミ　ミ　ヘビせ火ビビ火山労汎|
// |ビ・　ミ火允ヘㇵシ一火山洪洪允火ヘ　ㇵビ|
// |ビ・ㇸせ山允一ミヘシ汎山山允洪和洪火ミヘ|
// |ミㇵ丁労和火・ビ・ミㇵ一ミ火せせ洪李洪汎|
// |　シ洪労火・丁・一ㇵ火洪和耗奏耗李李允ヘ|
// |一允せミシヘヘㇸ火労群慶義奏和李李和汎丁|
// |ミ山　　一丁・火和覇群李允火丁丁丁火允せ|
// |ヘせせ一シヘヘヘ汎奏洪ビㇵ　一ㇵ一　ㇸヘ|
// |ㇸせ李丁ㇵヘヘシ一火火一ㇵビ山汎汎山火丁|
// |ㇸビ和允ㇸ一丁　丁一ㇵ　丁汎耗和汎山せ山|
// |丁ㇵ允李ミㇵㇵ火ㇵ一ミㇵ山耗和山ミ一　・|
// |火　ビ汎丁一ヘ洪丁ㇸ・ビ和耗山ㇵ一ビせ火|
// |せㇵ一シシㇵビヘㇵせ山李耗せㇸ丁汎耗耗李|
// |汎ビシヘミミシシ洪群李奏山・火和慶覇覇耗|
// |奏李洪火ㇸビ・火耗群耗労シヘ洪義覇覇覇耗|
// +----------------------------------------+
// 2026 (August 1st) 22:45:37
// end signature
