#include <algorithm>
#include <bits/stdc++.h>

using namespace std;

int main() {
    int N;cin>>N;
    vector<int>A(N+1);
    for(int i=1;i<=N;i++)cin>>A[i];
    vector<array<int,3>>B;
    for(int i=1;i<=N-1;i++){
        for(int j=i+1;j<=N;j++){
            int D=A[j]-A[i];
            B.push_back({D,A[i]%D,A[i]/D});
        }
    }
    sort(B.begin(),B.end());
    int pd=-1,pmd=-1,p=-1,l=1,best=1;
    for(auto [d,md,dd]:B){
        if(pd!=d||md!=pmd){
            pd=d;
            pmd=md;
            p=dd;
            l=2;
            best=max(best,l);
            continue;
        }
        l=dd==p+1?l+1:2; p=dd;
        best=max(best,l);
    }
    cout<<best<<endl;
}


// begin signature
// +----------------------------------------+
// |覇覇慶群耗李洪汎允山せせせ山允労和群義義|
// |覇陽和洪允火ビ丁シㇵ一一ㇵシ丁せ汎李和和|
// |耗洪せ丁ヘ一ㇸ　一ㇵㇵㇵ一　一ミせ山山山|
// |山丁ㇵㇸㇸ一ㇵ　ㇸㇵㇵㇵヘㇵㇸ一ヘㇵヘシ|
// |丁ㇸㇸ・ㇵ・一ㇵ・・ㇸ　　一ミミㇵ　　一|
// |シ　ㇵ・ㇵㇸヘ　ヘ　一シ丁丁ミ丁ビ丁一ㇸ|
// |シ　ㇵ・ㇵ一一一ㇵㇸミミシミビ山汎允山ミ|
// |ミ　一ㇸ一ㇵㇸヘ一ㇵミミシミミミ丁山洪允|
// |ヘ一ㇵㇵ　ヘ　シ・一シ丁火火山山せビせ洪|
// |　ㇸ・ㇸミㇸシ・シ丁丁丁ミㇵミ火允汎せ允|
// |・・ヘミヘ一一ヘ山允允汎山ビヘミせ労允允|
// |ㇸヘミ一ㇸシ・ミ允せ火ビ火せ丁一ビ山ミミ|
// |　シヘミㇵ一ㇵ一丁ヘ一ㇸㇸ一ヘヘヘミヘㇵ|
// |・・ㇵミビㇵ一ㇵ・・ㇵシシヘ一ㇵ一・・ヘ|
// |ヘ一　シ丁シシ　シシビ山允允せ火せビ丁ㇵ|
// |丁一ㇵ　ミㇸ丁ㇸヘ火汎李和和汎ビシㇸ・・|
// |丁一ㇸヘㇸヘㇵ一ビ汎耗陽耗汎ビ一・ヘミシ|
// |シ一　シヘ一ㇸビ洪奏覇奏汎丁・ヘ火允允山|
// |ヘㇸㇵヘシ・ビ洪群覇奏洪丁・シ山李耗和汎|
// |ㇵㇸヘ丁一ヘ山和慶義和山ㇵㇵせ李陽覇奏汎|
// +----------------------------------------+
// 2026 (April 8th) 13:36:51
// end signature
