#include <bits/stdc++.h>
using namespace std;
int main() {
    int R,C;cin>>R>>C;
    vector<vector<bool>>A(R+1,vector<bool>(C+1));
    for(int i=1;i<=R;i++){
        string s;cin>>s;
        for(int j=1;j<=C;j++)A[i][j]=s[j-1]=='#';
    }
    array<int,5>a={0};
    for(int i=1;i<=R;i++){
        int c=0,s=1;
        for(int j=1;j<=C;j++){
            if(!A[i][j])a=max(a,{++c,i,s,i,j});
            else c=0,s=j+1;
        }
    }
    for(int i=1;i<=C;i++){
        int c=0,s=1;
        for(int j=1;j<=R;j++){
            if(!A[j][i])a=max(a,{++c,s,i,j,i});
            else c=0,s=j+1;
        }
    }
    printf("%d %d %d %d\n",a[1],a[2],a[3],a[4]);
}

// begin signature
// +----------------------------------------+
// |洪せビミミ丁火允李李労労允せビビ火せ汎和|
// |・一シミミヘㇸ一丁ヘㇵㇵ　一ヘヘ一　ㇵビ|
// |允労和李李洪せシミシシ丁ミ丁火允汎火ヘㇸ|
// |ビミシシミ火允ビ一・ヘシシヘ・ㇵビ洪允シ|
// |ㇵ一ヘ丁シ一・一　ㇵ一　・・一　ㇸシ汎汎|
// |ビㇸ丁火ミヘ一ㇸビ　ミ火汎允丁・シヘ・せ|
// |火ㇸミ・　　一ミミ・一・　ヘ山労ビ　ビヘ|
// |せㇸシ山允山一ビㇵミ洪汎山ミㇸシ汎汎ヘシ|
// |丁ㇵビせシ丁ㇸ火ㇸ汎陽義耗李汎ビシ洪山・|
// |　一一　一一火・山群労せミㇵㇸ・ㇸㇵ丁ㇸ|
// |ㇸシ・　丁シシ丁洪丁ㇸㇵ丁せ山山火ミㇸ・|
// |山ヘ・山ㇵビㇸ火ㇸシ山李奏陽陽陽耗労せヘ|
// |李シミ李丁ヘミ・ヘ一ㇵミせ李義覇覇義群洪|
// |耗丁シ李李ミヘ丁・火火丁一ㇵ山耗和汎山山|
// |陽允　山奏耗ビ　丁ヘㇵ火汎山ㇵミせヘ　・|
// |義李ヘ　火和ビ允シ・ミㇵ　一一ㇵヘㇵ火山|
// |覇労ヘ丁ㇸせせ奏洪火シ一一一一一ヘ汎奏せ|
// |奏せㇸ汎ビヘ火洪ヘヘ丁せ丁せ一丁労慶群和|
// |山一せ群せ汎允ㇵビ汎奏洪汎ㇸせ奏覇覇覇陽|
// |・・汎和丁耗山・允義耗耗丁シ李覇覇覇覇陽|
// +----------------------------------------+
// end signature
