#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;string S;cin>>S;
    if(S.back()=='+'||S.front()=='-')return (cout<<"NO"<<endl),0;
    vector<int>order;
    for(int i=0;i<N;i++)if(S[i]=='+')order.push_back(i);
    for(int i=N-1;i>=0;i--)if(S[i]=='-')order.push_back(i);
    cout<<"YES\n";
    for(auto r:order)cout<<r<<" ";cout<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇義奏和労洪洪汎　允允汎労李李和奏陽|
// |覇義耗労允せシせ允汎允せビシㇸ火せ山汎李|
// |奏労山・山和奏群奏和労允せ丁シㇸㇵミ火允|
// |允丁せ奏慶慶奏李汎せㇸミ丁丁シㇸ一　ヘビ|
// |丁允陽覇慶耗洪せ・・ㇸ　　一ミ山山シㇸ一|
// |ㇸ和覇覇陽李山　ヘ　ㇵミ丁丁ミ丁火洪せシ|
// |・耗覇覇群労一一ヘㇸ丁山洪洪洪洪洪汎允允|
// |　耗覇覇奏洪ㇸヘㇵㇵせ労耗群群奏群群李汎|
// |丁慶覇群労ミ　ミ　丁汎奏義群奏和労汎汎汎|
// |奏覇群洪ビㇸシ・ミ汎奏耗奏耗和洪汎洪洪允|
// |覇奏汎火ヘㇵㇵヘ山耗群耗和和耗耗洪山允李|
// |奏洪ヘ火ㇸシ　ミ汎労汎山山山允洪李山洪汎|
// |耗允丁山ヘㇵㇵㇵ火火ミヘㇵㇵシ丁せ汎せ李|
// |奏汎　洪せㇵㇵㇵㇸヘ　ㇸㇵヘㇵ・ㇸミせ労|
// |汎李火丁汎山シ　シㇸㇵ丁せ山山火丁一ㇸ丁|
// |労労允ヘミ山允丁一一ビ允労和汎ビヘㇸ　　|
// |奏火允ヘ・ミ山ミ　丁汎和奏洪ビ一ㇸシ丁ミ|
// |陽丁火ㇸシ一ミ　丁汎奏群洪ビ・シせ汎洪允|
// |慶シ丁火せビ・ミ汎奏陽洪ビ　ミ汎耗群奏洪|
// |覇陽丁せ允シ一せ李義耗山ヘㇵ山和慶覇群洪|
// +----------------------------------------+
// 2026 (May 15th) 21:05:38
// end signature
