#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    vector<int>A(N+1);for(int i=1;i<=N;i++)cin>>A[i];
    vector<int>freqA(N+1),freqB(N+1);int uniqA=0,uniqB=0;
    for(int i=1;i<=N;i++)if(freqB[A[i]]++==0)uniqB++;
    int ans=0;
    for(int i=1;i<=N-1;i++){
        if(--freqB[A[i]]==0)uniqB--;
        if(freqA[A[i]]++==0)uniqA++;
        ans=max(ans,uniqA+uniqB);
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せ火火ビ丁丁丁ビ火山允洪和和|
// |和労允せビミシヘヘㇵ一一一ヘシ丁火允汎汎|
// |汎せ丁ヘ一ㇸㇸ　・ㇸ一ㇸ・　一ヘ丁ビビ火|
// |ビシㇸㇸㇸ・一・　ㇸㇸㇸㇵㇵㇵ一ヘㇵヘシ|
// |ヘ・ㇸ・一・・一　・・　　ㇸヘ丁丁ㇵ・ㇸ|
// |ㇵ　一　一・一　一　一ヘシシヘシシ火丁ㇵ|
// |ㇵ　一　一　　ㇸ一・ヘ丁火せ火火火ビビビ|
// |ヘ　ㇸ・ㇸ一・一ㇸ一ミせ山山允允山火火火|
// |一ㇸ　一シヘ　ヘ　ヘビ丁ミ丁丁ビ火火丁ミ|
// |　・一ㇸミ・ㇵ　ヘㇵ一ㇸㇸㇸ一ヘミシヘㇵ|
// |　ㇸ一丁一ㇸㇸㇸ　ㇸ一一一ㇸ・　一シシㇸ|
// |・シせミ・ㇵ・ㇵシ丁丁ビ丁ミシ一　一ㇵㇸ|
// |　ヘビヘ　一シビせ山允允允山火丁ヘ・ㇸ・|
// |・・シ一・ヘビ山汎労李李李労汎山火ミㇵ　|
// |ミㇸ　一・シ火允労和奏群李洪山ビミシシヘ|
// |せミ一　ㇸミせ洪和奏義奏労允火シ一・　　|
// |汎火シ　ヘビ允李奏義群和汎火シㇸ・ㇵヘヘ|
// |山ㇵㇸㇵビ允李群慶陽和汎火シ・ㇵミ火火ビ|
// |丁一ㇸ丁山労奏慶義耗洪せシ　ヘビ允汎允火|
// |シ　ヘ火汎和陽覇群李允丁一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (May 14th) 18:54:16
// end signature
