#include <bits/stdc++.h>
using namespace std;
int main() {
    double A,B;cin>>A>>B;
    cout<<(A>(B*(2.0/3))?"Yes":"No")<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇慶陽耗李労洪汎洪労李耗陽慶覇覇覇覇覇|
// |覇陽耗労允せビ丁丁ビ火山洪和群義慶慶慶慶|
// |耗洪せ丁ヘㇸヘミビビビ丁せ洪李耗耗和和耗|
// |允丁ㇵ　シビ丁シヘㇵヘシ丁火山允山山山汎|
// |丁ㇸ・ミ丁ㇵ・・一ㇵ一ㇸ　一ヘミシヘシミ|
// |シ　一丁ㇵ・ヘㇵ・ㇸ　　・　　　ㇸ一一・|
// |シ・一ミ　ヘ一・ㇵ　・ㇸシㇵ　ヘ丁火火火|
// |ミ・一ヘㇸㇵ・・ㇵ一一ミ丁・ㇵビ允洪労労|
// |ヘ一ヘ　シ　・シ・ㇸ丁火ㇵ一ビ汎和群陽陽|
// |　ㇸ・シ・一ヘ一一火せヘ一火洪奏慶覇覇覇|
// |・ㇸシㇸヘ一ㇵㇵ丁シシㇸ火労群覇覇覇覇覇|
// |ㇸ一　丁・ミ　一　ㇸ　ミ汎耗覇慶義義義慶|
// |　ㇵ　ビ一ヘ・一丁ビシミ允耗奏和李李李耗|
// |ㇸ　一ヘ丁・シ一火洪允ミビ洪労允せせせ山|
// |火一ㇸ　ミビㇸヘシ允労せㇵビ允ビシㇵ一ㇵ|
// |洪火ㇵㇵㇸビビ一ㇸシビ丁ㇵ一ビヘ　一ヘㇵ|
// |和山シ・　シ山丁ㇵ　一ヘㇵ一シ　シ火山せ|
// |和山シ　・ヘ丁せビシㇵ一一　・丁允李和洪|
// |李山ミ　ㇸ一ミミ丁ビビ火シ　丁汎奏慶群労|
// |耗汎ビㇵ・・一シ丁ビビ丁丁ㇵせ李陽慶奏汎|
// +----------------------------------------+
// 2026 (July 4th) 20:02:15
// end signature
