#include <bits/stdc++.h>
using namespace std;
int main() {
    int X,Y,L,R,A,B;cin>>X>>Y>>L>>R>>A>>B;
    int c=0;
    for(int i=A;i<B;i++){
        c+=(L<=i&&i<R?X:Y);
    }
    cout<<c<<endl;
}

// begin signature
// +----------------------------------------+
// |労労洪允山せ火ビビビ火火山允洪労労洪洪洪|
// |允允せビ丁シヘヘヘヘシミビせ山允山山山山|
// |ビビミヘ一・一ヘヘヘヘヘシ丁ビビ丁丁丁ビ|
// |ヘヘㇸ・ㇵㇵㇸ・　　　・一ㇵヘㇵㇵㇵㇵヘ|
// |　・・ㇵㇸ　ㇸ一一一一一・　・　・・　　|
// |ㇵㇵ一・　　　　・　　・　　・　・ㇸㇸ・|
// |丁シㇵ・・一一　一　ㇵ一・　ㇸ一ヘシシシ|
// |ミㇵ・・ㇵシㇸㇸㇸㇸシシㇵㇸ・　ㇵミ火火|
// |ヘ・ㇸヘ丁ㇵ　ㇵ　ㇵヘヘヘシ一　　ㇵミせ|
// |　・シビシ・一・　　　　　ㇸㇵ・　一シビ|
// |　ㇵミヘㇸㇸㇸ一ㇵヘヘㇵ一・　一・・ヘ丁|
// |・シㇸ　一ヘミ丁ビビビ丁シヘㇸ　一　一シ|
// |　一　ㇵミビ火山山允山せ火丁シ一　　　ㇵ|
// |・・ㇸシビせ允洪労労労洪汎允火丁ヘㇵㇸ　|
// |ヘ・一シ火山洪李和耗耗李汎山ビミヘㇵ一ㇵ|
// |ヘ・一ミ火汎労耗奏陽耗労允火ミㇵ・　・・|
// |ㇵ　ヘビ山労和群義群和洪せ丁ㇵ　ㇸヘシヘ|
// |　ㇵ丁山洪和群慶陽耗洪山丁ㇵ　ㇵミビ火丁|
// |一ミせ洪和群慶陽耗労山ビヘ　ㇵ丁山允山ビ|
// |ヘビ允労奏義慶群和汎せミㇸㇸミせ汎労山ビ|
// +----------------------------------------+
// 2026 (July 4th) 20:05:24
// end signature
