#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    string S;cin>>S;
    int i=1,j=N;
    vector<int>A(N+1);
    bool dir=1;
    for(int k=N;k>=1;k--){
        if(S[k-1]=='o')dir=!dir;
        if(dir==0)A[i++]=k;
        else A[j--]=k;
    }
    for(int i=1;i<=N;i++){
        cout<<A[i]<<" ";
    }
    cout<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇覇陽耗和李労労洪汎洪労和耗耗奏陽慶|
// |覇覇群和汎山火ビビ丁ミミ丁ビ山山允汎李耗|
// |陽李允ビヘ一シㇸ　ㇸ一ㇸ　ㇸ一ㇵシビ山洪|
// |汎ビㇵ一ヘ　ヘビ火丁ミ丁ビ山火一・ㇸシせ|
// |ビㇸ一一一ビ火シㇸ　ㇸ　　ㇵ丁允ビ・・ヘ|
// |ミ・ヘ　丁山シ　ヘ　ㇵ丁ビビ丁丁せせシヘ|
// |ミ・ヘ　汎せㇵ一ヘㇸ丁允労李労洪汎汎せミ|
// |シ・一ヘ李せ一ヘㇵㇵせ李和汎労耗群群耗洪|
// |　ミせ允洪丁　丁　丁洪汎汎允汎労耗義慶耗|
// |ビ洪せ和せㇸミ・丁洪耗群耗洪火せ洪奏覇耗|
// |李丁労允ヘㇵㇵシ汎奏陽奏耗労ビ丁允耗群和|
// |　せ和せㇸミ　丁洪李洪允山山丁ヘせ汎洪労|
// |　ビ労允ヘㇵㇵヘせ火ミヘㇵㇵシ丁丁シミビ|
// |李ㇸ火労せㇵㇵㇵ一ヘ　一ヘシㇵㇸㇸミヘ　|
// |ビㇸ　ビ洪允シ・ミㇸヘビ山允允山ビㇵㇸ丁|
// |　ミシ　丁允汎丁ㇸ一火汎和奏洪火ヘ・　　|
// |シ　せシㇸ丁允ミ・ビ洪奏陽労火一一ミビ丁|
// |せミ汎火ミ一丁　ビ労陽陽労ビ・ミ山労労汎|
// |洪允和洪山火・丁洪陽義李ビ　丁洪奏義群労|
// |群奏耗奏汎シ一山耗覇奏允ヘㇵ允奏覇覇義労|
// +----------------------------------------+
// 2026 (July 4th) 20:12:14
// end signature
