#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    int T;cin>>T;
    while(T--){
        int A,B,K;cin>>A>>B>>K;
        int c=0;
        vector<int>a,b;
        int aa=A,bb=B;
        for(int i=0;i<64;i++){
            a.push_back(aa);
            b.push_back(bb);
            aa/=K;
            bb/=K;
        }
        int i=0,j=0;
        while(i<=64&&j<=64){
            if(a[i]==b[j])break;
            if(a[i]>b[j])i++;
            else j++;
        }
        cout<<i+j<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |火火火せ山山せ火火火ビビビ火せ允汎労和耗|
// |ヘヘシミ丁ミシヘヘヘㇵㇵヘシミビせ允洪洪|
// |　　・一一ㇸㇵ・　・・　　ㇸㇵシビせせせ|
// |ヘヘ一・　　ㇸㇸ・ㇸㇸ　　ㇸ　一ミシミミ|
// |火ビ丁シㇵ一一　　・・　・　　　・・・一|
// |汎汎允せビシㇸㇸ・一ㇵㇵ一・　ㇸㇵㇵㇵ一|
// |労労労允ビヘㇵㇵミビビビビミヘヘシ丁ビビ|
// |允山山山ビミせ洪和耗奏和労山火ビ火火ビ丁|
// |ビ丁丁丁ビ洪奏陽陽群奏奏和労汎允汎洪允せ|
// |一一シ汎奏陽奏耗李李奏群群和洪李耗和労山|
// |一火和陽奏李労汎労奏慶慶群李耗陽陽耗労せ|
// |せ耗群和労允せ汎李群義陽耗李奏耗耗和汎火|
// |労陽耗労山火火允労和奏耗和労李洪洪洪允ビ|
// |労群和洪せ丁山洪和奏陽耗労汎汎山せ火せビ|
// |山奏耗洪せミ山洪耗群陽奏李汎せビミシシシ|
// |火耗耗洪せミ山労耗義群耗労山ビシ一・　　|
// |山奏和汎火丁允李群慶奏李允火シ・・ㇵヘヘ|
// |労奏労山ミせ洪耗義群和汎火ヘ　ㇵミビ火丁|
// |耗和汎ビビ允李群陽和汎火シ　ヘビ山汎允火|
// |奏李允ビ火汎和群群李允丁一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (July 4th) 20:36:39
// end signature
