#include<bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    int p=1e9,c=0,l=0;
    for(int i=1;i<=N;i++){
        int v;cin>>v;
        if(v>p){
            if(++l==2)c++;
        }else l=1;
        
        p=v;
    }
    cout<<c<<endl;
}

// begin signature
// +----------------------------------------+
// |ビビビ火火せ火ビビビ火火火火せ山汎洪李耗|
// |ヘヘヘシミシヘヘヘヘシシシミ丁ビせ允洪李|
// |　　・ㇸ一・一一ㇸ・・・ㇸ一ヘミビせ汎労|
// |ㇵㇵ一・　ㇸ　ㇸ・　ㇸㇸㇸ　ㇸㇵミ火山洪|
// |ビ丁ミヘ一ㇸ　ㇸㇸ　　　・　ヘㇵㇵミ火允|
// |丁シヘㇵㇵ　一　ㇸ　・一ㇵㇸㇸ　　ㇵシ火|
// |ヘ一・　　　一・一　ㇵシ丁ミㇵ　一・・シ|
// |ㇸ　ㇸㇵ　　ㇸㇸㇸㇸシシㇵミ丁ㇵ　・　・|
// |ㇸ・一ミ　一　ㇵ　ㇵヘㇵヘシミシㇵ・ㇸ　|
// |　・シ　シ・一・・　　　・ㇸㇵシシㇵㇸ　|
// |　ㇵ・ヘㇸㇸㇸ一ㇵㇵㇵㇵ一・　一シㇵ　・|
// |・　一　一ヘミ丁丁ビ丁ミシㇵㇸ　一ㇵ　・|
// |　一　ㇵシビ火せ山山山せ火丁シ一　・・ㇸ|
// |・・ㇸシ丁せ允汎洪労労洪汎山火丁ヘㇵㇸ・|
// |シ・ㇸシビ山汎労和耗耗李汎山ビミヘㇵㇵㇵ|
// |ヘ・一ミ火允労和奏陽耗労允火ミㇵㇸ　　　|
// |ㇵ　ヘビ山洪和群義群和洪せ丁ヘ・ㇸㇵヘヘ|
// |　ㇵ丁山洪和群慶陽耗洪山丁ㇵ　ㇵミビビ丁|
// |一ミせ洪和群慶陽耗労山ビヘ　ㇵ丁せ允山ビ|
// |ヘビ允労奏義慶群和汎せミㇸㇸミせ汎労山ビ|
// +----------------------------------------+
// 2026 (June 8th) 15:29:20
// end signature
