#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,M;cin>>N>>M;
    int NM=max(N,M);
    vector<int>prime(NM+1,1);
    prime[1]=0;
    for(int i=2;i<=NM;i++){
        if(prime[i]){
            for(int j=i+i;j<=NM;j+=i)prime[j]=false;
        }
    }
    for(int i=N+1;i<=M;i++){
        if(prime[i])return cout<<i<<endl,0;
    }
    for(int i=M;i;i--){
        if(prime[i])return cout<<i<<endl,0;
    }
}

// begin signature
// +----------------------------------------+
// |陽耗和労洪汎汎允山せ火火せ山允洪李奏陽覇|
// |労汎山火ビ丁丁ミシヘㇵㇵヘミビせ汎李奏義|
// |火ミヘ一ㇸ・ㇸ　ㇸミ火ビ火火ミ丁せ洪和陽|
// |一　一ㇵヘヘシ火ミシヘヘシ丁せせ丁山労奏|
// |一ミビ火せせミㇵ　・ㇸ　　ㇸシ火山ビ汎李|
// |ビせ允洪丁ビㇵ　ㇵ　一シミミシミ丁火丁せ|
// |汎洪労労せ丁一一ㇵㇸミ火山せ丁シㇵㇵㇵヘ|
// |和耗耗洪允丁ㇸㇵ一一ビ火せ火丁ミミシㇵ　|
// |陽群労ミ山シ　シ　ミ山労労洪汎山ビせ火ヘ|
// |群労一汎丁ㇸヘ　シ山労奏群奏和洪せビ火シ|
// |労　山火ㇵ一一ㇵ火労群覇覇義奏李允丁一ヘ|
// |山丁汎丁ㇸヘ　シせ労耗義慶義陽和汎ビ一　|
// |せシ山火ㇵ一一一丁山洪和耗和奏奏労山ミ・|
// |山・ミ山ビ一一ㇵ・シ火山汎汎汎洪洪允山ミ|
// |洪火　シせ火ヘ　ヘㇸㇸシ丁ビ丁火火ビ山山|
// |洪山ミ　シ火せミㇸ・ㇵㇸ　ㇸㇸ一ヘビ允労|
// |火允ミㇵ・シ火せ丁ヘㇸ・・ㇸㇵミ火允李労|
// |ビせシ丁ヘㇸシ丁火火丁丁丁ビせ允労耗和洪|
// |ミ火ㇵせビ丁ミシミ丁火山汎洪李耗陽陽耗奏|
// |ㇸシ一山汎允山山允汎労和耗群陽慶奏奏奏慶|
// +----------------------------------------+
// 2026 (April 30th) 20:08:06
// end signature


