#include <bits/stdc++.h>
using namespace std;
int main() {
    int A,B;cin>>A>>B;
    if(A/gcd(A,B)==16&&B/gcd(A,B)==9)cout<<"Yes\n";
    else cout<<"No\n";
}

// begin signature
// +----------------------------------------+
// |和労汎山せ火ビ丁丁丁ビ火せ山允汎洪労洪洪|
// |汎山火ビミシヘㇵㇵヘヘミ丁ビ火せ允山山山|
// |せ丁シㇵㇸ・一　ㇸ一一・ヘシ丁ビビビビビ|
// |ミㇵㇸ　ㇸビ山汎汎允山ビミ一ヘシヘヘヘシ|
// |ㇵ・　ビ労奏群群耗李労汎せ丁ヘ・・・・ㇸ|
// |一　丁李義慶陽奏和労汎山せビ丁ヘ一一一ㇸ|
// |一　せ奏慶義陽奏李洪允せビミヘㇵシミミミ|
// |一ㇸ汎陽義群奏耗李汎せビ丁ミシシ丁火せせ|
// |ㇸビ耗陽奏耗李労洪山火せせせビビせ允汎汎|
// |丁和群耗李洪汎山せせ汎洪汎允火山洪労李労|
// |李奏和労汎山火ビ山洪李和労允山洪李李李李|
// |奏和洪允火丁丁せ汎李奏耗労山汎汎汎允汎汎|
// |耗労允せ丁ヘミせ汎労和李洪山山せ火火火せ|
// |李労允火ミㇵㇵ丁せ允洪洪允せ火丁ミミミミ|
// |山李汎せ丁ㇵ　ㇵミビせ山山火丁シㇵ一ㇸ一|
// |シ汎洪せ丁ㇵ　　一ヘミ丁ビ丁シ一・　ㇸ・|
// |ㇵせ汎せミ一　一　ㇸㇵヘヘㇵ一　一ヘシヘ|
// |ㇵせ允ビシㇸㇸヘ一・　　　　・ㇵミビビ丁|
// |ヘ火せ丁ㇵ　ㇸㇵㇵㇵㇵㇵㇵㇵㇵ丁せ允山ビ|
// |一丁火丁ㇵ・　　ㇸㇸㇸㇸㇸㇸシ火允汎せ丁|
// +----------------------------------------+
// 2026 (June 20th) 22:01:43
// end signature
