#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;string C;cin>>N>>C;
    bool good=false;
    for(int i=1;i<=N;i++){
        string S;cin>>S;
        good|=S[C[0]-'A']=='o';
    }
    cout<<(good?"Yes\n":"No\n");
}

// begin signature
// +----------------------------------------+
// |允せ火火火火せ山山允允汎汎允山山山允汎労|
// |ミヘㇵ一一ㇵシミミミ丁丁丁ミシシミ丁火山|
// |　ㇸ一ㇵ一・　一一ㇸㇸㇸ　　　　・一ヘ丁|
// |丁ビ火火ビミヘ一ㇵ一一ヘヘヘシシヘㇸ　ㇵ|
// |允洪洪洪せミㇵ　・　　　・・　　　ㇸㇵ・|
// |李耗李允ビㇵ　　一・一ヘシシヘヘシヘ一　|
// |奏陽和允丁一ㇸㇸㇵ・シビせ山山せせ火火丁|
// |陽義和汎丁ㇸㇸ一一一丁山洪李李洪李労汎山|
// |覇陽李山ミ　　シ　シせ労耗陽陽奏群群和汎|
// |義耗洪ビ一ㇸヘ・ヘせ洪奏慶慶群耗李労洪汎|
// |和汎ビㇵㇸ一一ㇵ火洪耗奏群耗李汎せ火火火|
// |汎ビㇵㇸ・ヘ　シ山汎洪李耗陽奏労山ミㇵヘ|
// |允ミ・ヘ一一ㇸㇵビ允汎山洪和群耗洪火ヘ　|
// |汎ビㇸㇵ丁ㇸㇵㇸ一ミ火火せ汎洪労労汎ビ一|
// |労せヘ・丁ビㇵ・ヘ　一シ丁ビビせせ火せ丁|
// |和允丁・シ火火ヘ・一ヘ・・ㇸㇸㇵヘ丁山せ|
// |和允丁・・シ火シシ一・　　　ㇸヘビ山労洪|
// |洪せシ・ヘ一シミ火丁ミシシ丁ビ山洪和群李|
// |山ビㇵ一ビミシシミ丁火山允允洪和李奏和汎|
// |ミ丁ㇵㇸ丁允ビヘビせ山山せ洪耗労洪洪允ビ|
// +----------------------------------------+
// 2026 (June 20th) 22:08:48
// end signature

