#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,M;cin>>N>>M;
    int i;
    for(i=0;M;i++){
        M=N%M;
    }
    cout<<i<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇慶陽耗李労洪汎洪労李耗陽慶覇覇覇覇覇|
// |覇陽耗労允せビ丁丁ビ火山洪和群義覇覇覇覇|
// |耗洪せ丁ヘㇸヘミビ火ビ丁せ洪李耗陽覇覇覇|
// |允丁ㇵ　シビ丁シヘㇵㇵヘミ火山労耗陽覇覇|
// |丁ㇸ・ミ丁ㇵ　ㇸ一ㇵㇵㇸ　一ミ火汎和陽覇|
// |シ　一丁一・ヘ一・ㇸ・　　　　一丁山李群|
// |シ・一シ　ヘㇸ・ㇵ・　　・ㇸ　ヘミヘ火洪|
// |ミ・一ヘㇸㇵ・・ㇵ一ミ丁ミヘ・一・シミビ|
// |ヘ一ヘ　シ・・シ・シ山汎汎山丁一一ㇸ　一|
// |　ㇸ・シ・一ヘ一ㇵせ李奏耗洪せヘ　ㇵシ・|
// |・・シㇸ一一ㇵㇵせ李耗洪允せビ丁ㇵ　シ一|
// |ㇸ一一一・ミ　丁汎労山ビヘ一・・ㇸㇸㇵ一|
// |ㇸ丁ビㇸ一ヘ・ミ允せミㇸㇸヘミミシㇵ　ヘ|
// |ㇸビビ・シ・シ　ミビㇵㇸミ火允允山せビㇵ|
// |・シせㇵㇵビㇸㇵㇸㇵ一ㇵ火汎允ビシㇵ一ㇵ|
// |シ・丁ヘ一火ビ一ㇸㇵ　シ山労せヘ　一ヘㇵ|
// |ビㇸㇵ一一丁山ミ　ヘ丁ビ洪山シ　シ火山せ|
// |火ヘ・　ヘヘ丁・ミ允洪汎允シ・丁允李和洪|
// |山ビミヘ火丁ㇵㇵせ労奏汎丁　丁汎奏義群労|
// |李汎ビシ允火一ヘせ労李山ヘㇵせ李陽慶奏汎|
// +----------------------------------------+
// 2026 (May 30th) 22:01:46
// end signature
