#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    int T;cin>>T;
    while(T--){
        int x1,y1,r1,x2,y2,r2;cin>>x1>>y1>>r1>>x2>>y2>>r2;
        int x=x2-x1,y=y2-y1;
        int d=x*x+y*y;
        cout<<(((d<=(r1+r2)*(r1+r2))&&d>=(r1-r2)*(r1-r2))?"Yes":"No")<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |陽奏李洪汎山せ火火火火火火火山允洪労耗群|
// |和労允せビミシヘヘヘヘヘヘシ丁火山汎労耗|
// |允せ丁ヘ一ㇸㇵㇸ　　　　　ㇸㇵミビ山洪李|
// |ビシㇸ・一　ㇸ一・　　　・ㇸ　ㇵミ火允汎|
// |ヘ・・一・一・一ㇵㇵ一ㇸ　・　　一ミビせ|
// |ㇵ　一　ㇵ一一　一一ㇵㇵ一・・　・・一シ|
// |・　・　ㇵ一　・ㇵシ丁ビビミヘㇵヘㇵ一　|
// |ㇵヘヘㇵ一　ㇸ一シビ山允允山火丁ビ火ビミ|
// |丁ビ火丁シヘ一ヘビ山洪李李労汎山汎汎允火|
// |允汎允せ丁ㇵㇵ丁允労耗群群和洪李和李洪山|
// |和和労山丁ㇵ丁山労奏慶慶群李和群陽耗洪せ|
// |陽奏労山丁ヘ火汎和陽覇義耗李奏耗和和汎せ|
// |義奏李允丁ヘ火汎和群慶陽耗労労洪汎汎汎汎|
// |耗耗労允ビㇵミ山労奏義奏李洪允山火火火火|
// |汎洪汎山ビヘㇵビ允李群奏労允せビミヘヘシ|
// |ビせせビミㇵㇸミ山労耗耗洪山ビシ一　　　|
// |ヘシシビヘㇵ・シ火汎李李允ビヘ・ㇸヘシヘ|
// |　　ヘ丁一・ㇸシ火允洪汎火ヘ　ㇵ丁火火ビ|
// |ㇵ　ヘミㇸ・・ヘ丁せ山火ヘ　ヘビ允洪汎せ|
// |ヘ・一シ一　・ㇸヘミミミ一ㇸ丁山労和汎火|
// +----------------------------------------+
// 2026 (May 30th) 22:09:21
// end signature
