#include <bits/stdc++.h>
using namespace std;
#define int long long
signed main() {
    int N,M;cin>>N>>M;
    vector<int>A(N+1),B(M);
    for(int i=1;i<=N;i++)cin>>A[i];
    for(int i=1;i<=M;i++)cin>>B[i-1];
    sort(A.begin()+1,A.end());
    sort(B.begin(),B.end());
    reverse(B.begin(),B.end());
    int ans=0;
    for(int i=1;i<=N;i++){
        if(B.empty())break;
        if(A[i]*2>=B.back()){
            B.pop_back();
            ans++;
        }
    }
    cout<<ans<<endl;
}

// begin signature
// +----------------------------------------+
// |陽奏和労汎山せ火火ビ丁丁丁ビ火山汎労和和|
// |和労允せビミシヘㇵ一一一ㇵヘミビせ允汎汎|
// |汎せ丁ヘ一ㇸ・　ㇸ一一ㇸ・　一シビ火火火|
// |ビシㇸㇸ・ㇸㇸ　・ㇸㇸ・ㇸㇸㇸ一ヘヘヘシ|
// |ヘ・ㇸ　ㇵ　一一　・・　　ㇸㇸㇸㇸ・ㇸ・|
// |ㇵ　一ㇸ・一一　ㇵ　一ヘシシヘシヘㇸㇸㇸ|
// |ㇵ　一ㇸ　ㇵㇸㇸ一・ヘ丁火ビ火火火丁ヘ・|
// |・　　ㇸ　　・ㇵㇸ一ミせせせ山允せ允火ミ|
// |ㇵヘシヘㇵヘ　ㇵ　シ丁ミミミミ丁火せ允火|
// |火丁シヘ一・ㇵ　ヘㇵㇸ・・・ㇸㇵシ丁火せ|
// |ㇵㇸ　丁一ㇸㇸ・・一ㇵㇵㇵ一ㇸ　ㇸヘ丁火|
// |・ㇵビミ・ㇵㇸヘミ丁ビビビ丁シㇵ・ㇸシビ|
// |　ヘ丁ㇵ　ㇵミビせ允允汎允山せ丁シㇸ・シ|
// |・・シ一・シビ山汎労李和和労允山火丁ㇵ　|
// |ミㇸ　一ㇸミ火汎労耗奏奏李汎せビミヘヘシ|
// |せミ一　一ミせ洪和群義耗労山ビシ一　　　|
// |允火ヘ　ヘ火汎李群慶群李汎火シ・ㇸヘシシ|
// |せ　・ㇵビ允李群慶陽和汎火ヘ　ㇵ丁火せビ|
// |丁一一丁山労奏慶陽耗洪火シ　ヘビ允洪汎火|
// |シ　ヘ火汎和陽覇群李允丁一ㇸ丁山李和汎火|
// +----------------------------------------+
// 2026 (May 30th) 22:16:41
// end signature
