#include<bits/stdc++.h>
using namespace std;
int main() {
    string S;cin>>S;
    int cnt[2]{};
    for(auto c:S)cnt[c=='E']++;
    cout<<(cnt[0]>cnt[1]?"West":"East")<<endl;
}



// begin signature
// +----------------------------------------+
// |覇覇覇覇陽奏和李李李和耗耗耗奏奏奏陽義覇|
// |覇覇陽和洪山火ビビ火山せ山允允允汎洪和奏|
// |陽和允ビシ一ミミヘ一ㇸㇸㇵヘㇵヘミビ允労|
// |洪ビㇵㇸ丁ㇵ　ㇵシミミミヘヘヘㇵ　一ミ山|
// |ビㇸㇸミ・ㇵミシㇸ　　　一・・ヘビシ　ヘ|
// |ミ・ヘㇵㇵㇵㇸ・一・一ミビ丁シヘ　ヘ火ヘ|
// |ミ・ㇵㇸㇸヘシㇸシㇸ丁允洪労洪汎せシ　ミ|
// |丁・ㇵヘビ山ㇵㇵヘㇵせ李群義陽和洪允火一|
// |シ一シ山労ビ　ビ　丁洪群覇群李山丁ヘㇸ・|
// |　ㇸせ和せ一ミㇸミ汎奏陽耗汎ビ一ㇸシ丁丁|
// |・丁労汎シㇵㇵシ汎汎和李せヘㇸ丁山洪労労|
// |ㇸせ和せㇸミ　ビ允耗李せ一ヘせ労労労李耗|
// |　ビ労山ㇵヘ一シ允耗洪ミ・火汎せビ丁火山|
// |ㇸㇸ火李せ一シ一ヘせ洪ビ　ビビヘ　・　ㇸ|
// |せㇵ・ビ労山ヘ一シ　ヘビㇵシミ　シビ火丁|
// |和山シ・丁汎允シ　ヘヘ・ㇸㇸヘ一丁火労李|
// |群李せシ一ビ汎ビ一ㇵ　・・ㇸ・ミせ労群義|
// |群耗洪せミㇵビ火ヘ火ビ丁シ一ヘ允耗義覇義|
// |陽耗和洪山火ビビビビ火山ㇵ　ビ労陽覇義和|
// |慶耗群群耗李労労李李和允シ　丁汎和耗労せ|
// +----------------------------------------+
// 2026 (June 27th) 22:01:30
// end signature

