#include <bits/stdc++.h>
using namespace std;
int main(){
    int R,C;cin>>R>>C;
    vector<vector<char>>A(R+1,vector<char>(C+1));
    int t=99,b=-99,l=99,r=-99;
    for(int i=1;i<=R;i++){
        string S;cin>>S;
        for(int j=1;j<=C;j++){
            A[i][j]=S[j-1];
            if(S[j-1]=='#'){
                if(i<t)t=i;
                if(i>b)b=i;
                if(j<l)l=j;
                if(j>r)r=j;
            }
        }
    }
    for(int i=t;i<=b;i++){
        for(int j=l;j<=r;j++){
            cout<<A[i][j];
        }
        cout<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |火丁シヘヘシミビせせせ火ビ丁ミミミ丁火山|
// |ㇸ　ㇸㇸㇸ・　一シㇵㇵㇵ・　　　　・ㇵミ|
// |ミ丁ビ火ビ丁ヘㇸ一ㇵㇵヘミ丁丁丁ミㇵ・ㇸ|
// |汎洪労労汎せ丁ヘ一一ㇵヘミ丁ミ丁ビビシㇸ|
// |耗群和汎火ヘ・ㇸ　・ㇸ　　　　シㇸㇵミミ|
// |義陽李山ミ・ㇵ・ヘ　ㇵミシ・ㇸミㇵミ・一|
// |覇義和允ミ　一一ㇵㇸミせ允火ヘ・ㇵ火ㇵ　|
// |覇陽和允ミ　ㇸヘ一ㇵ火汎和労せヘ・一火ミ|
// |覇奏洪火一一　シ・丁允和陽耗汎丁　ㇸミ丁|
// |群労火ㇵ一ㇸシ　ミ允労労李和山シ　　ヘミ|
// |李せㇵ一ㇵ一一ヘせ李耗和李汎せミㇸㇸ一ビ|
// |允ミ　シㇸヘ・シ山李群義群和汎火ㇵㇸ・丁|
// |火ㇵ一ビㇵ一ㇵ一ビ允李奏群奏和汎丁ㇸ一ㇵ|
// |せㇵ一火火ㇵ一ㇵ・シ火汎洪洪洪李汎丁・ㇸ|
// |允ミ　ミ山せシ　ヘ一ㇸシ丁ビビ火せ火丁ㇸ|
// |汎丁　　シせ山ミ一・ㇵㇸ　ㇸㇸ一シ火山ヘ|
// |山ヘㇸヘ・シ火山ビシ一ㇸ・一ヘ丁せ洪允丁|
// |ミ　ミビヘ一シビせせビビビ火山洪和和允せ|
// |ㇸヘ山山火丁ミミ丁ビせ允労李耗群群耗李允|
// |　丁汎李洪汎允汎汎洪李耗群義慶覇陽慶耗允|
// +----------------------------------------+
// 2026 (June 27th) 22:05:21
// end signature
