#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,M;cin>>N>>M;
    using pii=pair<int,int>;
    set<pair<int,pii>>q;
    vector<int>cnt(N+1);
    set<int>col;
    vector<int>C(N+1);
    for(int i=1;i<=N;i++){
        int A,D,B;cin>>A>>D>>B;
        cnt[C[i]=A]++;
        col.insert(C[i]=A);
        q.insert({D,{i,B}});
    }
    for(int i=1;i<=M;i++){
        while(q.size()&&q.begin()->first<=i){
            auto [_,d]=*q.begin();
            auto [i,b]=d;
            if(--cnt[C[i]]==0)col.erase(C[i]);
            cnt[b]++;col.insert(b);
            q.erase(q.begin());
        }
        cout<<col.size()<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |耗李洪汎山山せ山せ火ビビ火せ山汎労耗陽覇|
// |汎せビミシヘヘシㇵ一ㇸ一ㇵヘミ火允労耗陽|
// |ミㇵ・　・ㇸ・・一一一一ㇸ　一ミ火汎和群|
// |　ㇵシ丁丁丁丁シㇵ　一一一ㇵㇵ一丁山労奏|
// |ミシヘヘヘシ丁ヘㇸㇸㇸ　　ㇸシビミ丁允労|
// |ㇸ　・ㇸㇸ・　・ヘ　・　　　　ㇸ一ㇵミ火|
// |ㇸ・ㇵビビ丁ㇸ一ㇵㇸミミヘ一ㇸ・・一ㇵ一|
// |シ・一ビ允丁・ヘㇸㇵビ允山火ビミシビ火火|
// |ㇵㇸヘせ山シ・ヘ・ミ山労労洪允山山汎洪洪|
// |　・丁汎丁・ヘ　シ山李群群耗李汎山せ火火|
// |・シ山火ㇵ一一ㇵ火労群覇覇陽耗洪せシㇵヘ|
// |・丁汎ビㇸヘ・シせ労耗義慶義群李山シ一ㇵ|
// |　シ山火ㇵ一ㇵ一丁山労和耗和奏耗汎ビㇸミ|
// |ㇸ・ミ允ビㇵㇸㇵ・シ火允汎汎汎洪洪允ミ一|
// |ビ一　シせ火ヘ　ヘ一ㇸヘ丁ビ丁ビ火ビせ丁|
// |汎ビㇵ　シ火せミ一　ㇵㇸ　・・ㇸヘ火允ミ|
// |李允ビㇵ・シビ山丁ヘ一ㇸㇸ一ヘミ火汎せせ|
// |和洪せ丁ヘㇸシ丁火火ビ丁ビ火せ汎労允山労|
// |奏李汎山ビ丁ミミミ丁火山洪労和奏洪李和陽|
// |義奏和労汎允允允允汎労和奏群義和奏陽義覇|
// +----------------------------------------+
// 2026 (June 27th) 22:14:36
// end signature
