#include <bits/stdc++.h>
using namespace std;
#define int long long
void solve() {
    int N;cin>>N;
    string S;cin>>S;
    vector<int>X(N+1),Y(N+1);
    for(int i=1;i<=N;i++)cin>>X[i];
    for(int i=1;i<=N-1;i++)cin>>Y[i];
    vector<int>dp(N+2);
    for(int i=1;i<=N-1;i++){
        if(S[i-1]=='R'&&S[i]=='S'){
            dp[i+2]=max(dp[i+2],dp[i]+Y[i]);
        }
        if(S[i-1]=='R'&&S[i]=='R'){
            dp[i+2]=max(dp[i+2],dp[i]+Y[i]-X[i+1]);
        }
        if(S[i-1]=='S'&&S[i]=='S'){
            dp[i+2]=max(dp[i+2],dp[i]+Y[i]-X[i]);
        }
        if(S[i-1]=='S'&&S[i]=='R'){
            dp[i+2]=max(dp[i+2],dp[i]+Y[i]-X[i]-X[i+1]);
        }
        dp[i+1]=max(dp[i+1],dp[i]);
    }
    cout<<max(dp[N],dp[N+1])<<endl;
}
signed main() {
    int T;cin>>T;
    while(T--)solve();
}

// begin signature
// +----------------------------------------+
// |覇覇義奏和労汎允せ火ビビビ火せ火せ山汎労|
// |慶奏李汎山火丁シㇵㇸㇵㇵㇸㇵㇵㇵヘシビせ|
// |和汎火ミㇵ一ミビ火せせ火火せシ・・・ㇵ丁|
// |山ミ一一ミせ允洪李李労洪允せせシ一ㇵㇵㇵ|
// |ミㇸ一丁山労労和耗耗奏耗和洪允ビミㇸ　一|
// |ㇵ・ヘ火洪李和労和耗耗李李和和労允火シ　|
// |一一　一丁允労和群義奏群耗奏李李奏李允ビ|
// |ビ火丁ヘ　ミ山労群奏耗耗奏耗李允李群耗洪|
// |洪労汎火ㇵ一火洪労洪汎汎汎洪労洪汎耗陽耗|
// |群奏洪火一ㇵせせ火丁丁丁丁火せ山汎李李労|
// |義和允シ・丁シㇵㇸ　　・ㇸヘミ火山せせせ|
// |李允丁・シ・ㇸㇵㇸ・　・一・ㇸシヘㇵㇵヘ|
// |山ビヘ・　ヘ・ㇸㇵヘㇵヘヘㇸ・　ㇸ一ㇵ一|
// |シヘ・ㇸㇵㇸㇸ・ㇸ一一一ㇸ　　ヘ丁ビビ火|
// |・・　・ヘㇸㇵ　ヘビビ火火丁ヘ丁ミミヘ一|
// |ビ丁ヘ　ヘヘ一　ミ山洪洪労洪山ミ一　・　|
// |洪せヘ一一ミ　ヘせ労奏群和允ミ・一ミ丁丁|
// |允シ　一ビㇸミせ労群義和允ミ　シせ汎汎山|
// |丁・ヘミㇵビ火労群慶耗汎ミ　ミ允李奏和山|
// |ヘㇸㇸビシ丁允和慶陽李せㇵ一火労群群労火|
// +----------------------------------------+
// 2026 (June 27th) 22:34:40
// end signature

