#include <bits/stdc++.h>
using namespace std;
int main() {
    int R,C,Q;cin>>R>>C>>Q;
    using pii=pair<int,int>;
    vector<vector<pii>>A(R+2,vector<pii>(C+2,{-1,'A'}));
    for(int i=1;i<=Q;i++){
        int r,c;string v;cin>>r>>c>>v;
        A[r][c]={i,v[0]};
    }
    for(int i=R;i>=1;i--){
        for(int j=C;j>=1;j--){
            A[i][j]=max({A[i][j],A[i+1][j],A[i][j+1]});
        }
    }
    for(int i=1;i<=R;i++){
        for(int j=1;j<=C;j++){
            cout<<(char)A[i][j].second;
        }
        cout<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |丁シヘㇵㇵㇵヘミビビビ丁ミシシシミビせ允|
// |・　ㇸㇸㇸ・　ㇸㇵ一一・　　　　ㇸㇵミビ|
// |シ丁シヘㇵㇸ　ㇸ一ㇵㇵシミヘㇵㇵ一　一ミ|
// |ㇵ・　ㇸ一一ㇸ　・ㇵヘ一　・一一ㇸ　　ㇵ|
// |ㇸ・ㇸミビビシ一　・・　　ㇸヘㇵ一一一・|
// |ㇵ　ㇵビ山丁一・ㇵ　一シミヘ一・・・ㇸㇸ|
// |ヘ・一ビ山ミㇸ一一ㇸシ丁シヘㇵ・ㇸヘヘ一|
// |ヘ　一ビ山ミ・ㇵㇸ一丁山山せ火丁ヘ・　・|
// |ㇵㇸㇵ火せヘ　ヘ・ミせ洪李労洪允火シ一ㇵ|
// |　・丁允丁・ヘ　シせ労耗群奏和洪山丁ㇵㇸ|
// |　シせ火ㇵ一一ㇵ火洪耗義覇義奏李允ビ一ㇸ|
// |・ミ允丁ㇸヘ　ヘ火洪和群陽群陽和汎ビ一　|
// |　シせビㇵㇸ一ㇸミせ汎李和李和耗洪せヘヘ|
// |ㇸ・ミ山丁一ㇸㇵ・ヘビ山允允允汎汎山火火|
// |丁一　シ火ビヘ　ㇵㇸㇸヘミ丁ミビビ丁せせ|
// |允丁ㇵ　ヘビ火シㇸ　一ㇸ　・・ㇸヘビ山ビ|
// |洪山丁ㇵ・ヘビ火ミヘ一・・ㇸㇵミ火允山ミ|
// |李汎火ミヘㇸヘ丁ビビ丁丁丁ビ火允洪洪せビ|
// |労労允せビミシシシ丁ビせ允洪労和和労洪せ|
// |允洪労洪允山山山山允洪労和奏群群耗奏労せ|
// +----------------------------------------+
// 2026 (June 27th) 22:34:42
// end signature
