#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    string A,B;cin>>A>>B;swap(A,B);
    int x=0,y=0;
    vector<int>a(2*N+1),b(2*N+1);
    for(int i=1;i<=2*N;i++)(A[i-1]=='D'?y:x)++,a[i]=x-y;
    x=y=0;
    for(int i=1;i<=2*N;i++)(B[i-1]=='D'?y:x)++,b[i]=x-y;
    int ans=0;
    for(int i=0;i<=2*N;i++)ans=max(ans,a[i]-b[i]);
    cout<<ans/2<<endl;
}

// begin signature
// +----------------------------------------+
// |義陽義義覇慶陽群耗李労洪労李耗陽覇覇覇覇|
// |汎允汎洪和洪允せビシヘヘシビ山労奏覇慶慶|
// |一一ㇵミミヘㇵ・ヘミシシㇵ　ヘ火労洪労李|
// |ビビシㇸ一ㇵミ一　ㇸㇸ　　　一ㇵシヘシ丁|
// |耗和労山ミ一一ヘ　一一　・ㇵ　ㇵシミシ一|
// |奏洪火ヘ・・ㇸ・丁ㇸ・　　一シビ汎李李洪|
// |労火一一丁せㇵヘシ一ビせせ火丁ㇵ　ミ允耗|
// |允ヘ一火火シ・丁ㇵ　　一ミせ洪労山シ・ビ|
// |シㇵ丁シ　ヘビせビ一ㇸシ丁火火允耗洪丁ㇸ|
// |　一　シシシビ一ヘ火山労労和奏耗李耗山允|
// |・シシシシヘヘミせ丁ビせせ火汎耗和和耗群|
// |ㇸ允労汎一丁・丁允李耗奏李允火丁丁ビせ洪|
// |　せ奏労ミヘシヘ允奏奏汎ビ一・ㇵㇵ一　ヘ|
// |一ㇸ山奏洪シヘミㇸビ労火ㇸヘ火允洪汎山丁|
// |ヘヘ　せ和山ビ　丁ㇵ一丁・ビ労允丁ヘㇵシ|
// |ビ一ミ　ビせ洪せヘㇸミㇵㇵ允洪ミ　ヘ丁ミ|
// |ビ一汎ミㇸ火労和允シシㇵ火李ビ・火洪和李|
// |一ビ和允丁ㇵ火汎山　せせ李ビㇸ山奏覇覇陽|
// |ヘ洪義李允允せせヘミ李洪せ　山群覇覇覇義|
// |ビ和覇労洪群奏山　せ汎李ミヘ洪慶覇覇覇奏|
// +----------------------------------------+
// 2026 (May 22nd) 18:10:48
// end signature

