#include <bits/stdc++.h>

using namespace std;

#define int long long
const int MOD=1e9+7;
signed main() {
    int N;cin>>N;
    vector<int>A(N+1),cnt(32);
    for(int i=1;i<=N;i++){
        cin>>A[i];
    }
    for(int i=1;i<=N;i++){
        for (int k=0;k<=31;k++){
            if(A[i]&(1<<k))
                cnt[k]++;
        }
    }
    int S=0;
    for (int k=0;k<=31;k++){
        S+=(((cnt[k]*(N-cnt[k])*2)%MOD)<<k)%MOD;
        S%=MOD;
    }
    cout<<S<<endl;
}

// begin signature
// +----------------------------------------+
// |覇義群和労汎允山山山火ビビビビせ山汎労耗|
// |群和労允せビミミシシㇵ一ㇸ一ㇵシ丁火允労|
// |労允ビシㇵ一シ一　ㇸ一ㇵㇵ一・・ㇵミせ汎|
// |せミ一ㇸヘ・・ㇵミミシシミビシㇵ　ㇵビ火|
// |シ・ㇸㇵ　ㇵシヘㇸ　　　・ㇵミビヘ　ㇸㇵ|
// |ヘ　ㇵ・ㇵ一ヘ　　ㇵシミシㇵ　ㇵ丁ミ・ㇵ|
// |ヘ・一　ヘㇵ一・ㇵミシシミ丁丁ㇵ・シ丁一|
// |ヘ　一　ヘㇵㇸ一ㇵㇸ　一ヘシミシシ　シ丁|
// |ㇵㇸㇵㇸㇸシ　　・一シビビビ火せビ一ㇵビ|
// |　・　ㇵ一ㇸ一・シヘヘヘ一ㇵヘシ丁ㇸヘビ|
// |・・ヘ・ㇵ一ㇵミㇵ・　ㇸㇸㇸ　・ㇵㇸ丁シ|
// |・ㇸ・一・ヘㇵ　ㇵシ丁ビビ丁シㇵ　ヘビㇸ|
// |　・・ㇸ一一・シビせ允汎汎允山ビシミミ・|
// |ㇸ・　一一ㇸㇵ丁山洪李和耗労允火ビ丁丁ㇸ|
// |丁一　ㇵㇵㇸヘ火汎李奏陽和汎火ミㇵシ丁一|
// |允ビㇵ　ヘ　ヘせ洪耗義群李允丁ㇵㇵ丁シ・|
// |労せ丁ㇵ・・丁允和陽慶耗洪火ㇵヘビシ・一|
// |汎ビせミ　シ山李群覇奏労せ丁ミヘㇸㇸシ火|
// |山ビビㇸㇵ火洪奏覇陽李山シ・　一シビ山汎|
// |山せミ　シ山李陽慶奏洪火ㇵ一ミビ山洪労せ|
// +----------------------------------------+
// 2026 (April 11th) 15:37:45
// end signature

