#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    string S="HelloWorld";
    for(int i=1;i<=10;i++){
        if(i!=N)cout<<S[i-1];
    }
    cout<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇覇陽奏和李労李和耗陽義覇覇覇覇覇覇|
// |覇覇群和洪山火ビビ火せ汎労李耗群慶覇覇覇|
// |陽李允ビシㇸシビビ丁丁丁ビせ汎李群慶覇覇|
// |汎ビㇵ・ミ丁ヘㇸ　・ㇵビせせビ允李群覇覇|
// |ビㇸㇸ丁ヘ　ㇵヘシㇵ一一ヘ丁山労汎李群覇|
// |ミ・ㇵミ　ヘ一ㇵ・ㇸㇸシミミヘ丁允和洪奏|
// |ミ・ㇵヘㇸシミ　シ・ミ山汎洪汎山允せ汎汎|
// |丁・ㇵㇵㇵ一ヘ一ヘ一火労奏耗洪山ビミミミ|
// |シ一シ　シビ　丁・ミ汎奏覇群労ビ・　・・|
// |　ㇸ・ミ丁一シ一シ允奏義陽陽労ビ　　ㇸㇸ|
// |・一シビヘㇵㇵヘ允奏和労洪洪山ビㇵㇵ・シ|
// |ㇸㇸ・火・丁　ビ労允火丁ミミビせビ一　ビ|
// |　ㇸシ山一シㇸミ火ヘ・・ㇸㇸ　一ミビㇸ丁|
// |ㇸㇸシ李火ㇸシ　ヘ　ヘビ火せ火ミ一ㇸ丁ヘ|
// |せㇵ・ミ労せㇵㇵㇵㇵ火汎李和労山丁シㇸヘ|
// |李山ヘ　ビ汎せヘ・ミ允和陽和允ミㇸㇸㇵ一|
// |群労せㇵ一ビ允ヘㇵせ和義群汎丁　シ火山せ|
// |義和山ヘシヘミㇸ火李義陽洪丁　丁汎和耗労|
// |義和山シ山ビ　丁労義義労ビ　ビ労陽覇義李|
// |覇奏洪ビ汎ミ一せ和覇奏允ヘㇵ山耗覇覇陽労|
// +----------------------------------------+
// 2026 (May 23rd) 22:01:25
// end signature
