#include <bits/stdc++.h>
using namespace std;
int main() {
    int N;cin>>N;
    for(int i=1;i<=N;i++){
        string S;cin>>S;
        cout<<"22233344455566677778889999"[S[0]-'a'];
    }
    cout<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇陽耗李労洪洪洪労李耗奏陽義覇覇覇覇|
// |覇陽耗労允せビ丁丁ビ火山汎洪李耗群慶覇覇|
// |耗洪山丁ヘㇸヘ丁丁ミシミ丁火山洪和群覇覇|
// |允丁ㇵ・シミㇵ・ㇵヘㇵㇸ・ㇵ丁せ洪耗義覇|
// |丁ㇸ・ミㇵ　ㇵ丁ヘ一ㇸ一ㇵ　・シ火洪耗義|
// |シ　ㇵシ　ㇸ丁一・ㇸㇸヘミシヘシヘ丁允和|
// |シ・一ヘㇸ・シ　ヘ・シ火允汎允せせ火火せ|
// |ミ・一一ㇵ　ㇵ一ㇵ一ビ汎李耗耗李和李洪汎|
// |ヘ一ヘ　ヘㇸ　ミ・ミ允和陽覇覇陽義義奏労|
// |　ㇸ・シ・一ヘ一ヘせ和群奏耗耗奏群義陽労|
// |・ㇸシ　ヘ一ㇵㇵ山和労汎允允汎洪李耗奏労|
// |ㇸㇸ一ヘ・ミ　丁汎せビミシミ丁火山労李耗|
// |　ㇸ一ヘ一ヘ・シビヘ・　ㇸ・　一シ火山允|
// |ㇸㇸヘ　ミㇸシ　ヘ　ㇵミビビビシ一ㇸミヘ|
// |火一・ㇸシ火一一一一丁山洪労汎せ丁ヘㇸㇵ|
// |洪火ヘ　ヘ山火ヘ　シせ労耗労せミㇸ・一一|
// |耗汎火一一丁せヘ一火洪奏和允ミ　ヘビせ火|
// |群労せヘシㇵミ・ビ洪群耗允ミ　ミ允労李洪|
// |群労せシせ丁　ミ汎奏奏汎丁　丁汎奏義群労|
// |義和汎ビ允シㇸ火労陽和山ㇵㇵせ李義覇奏汎|
// +----------------------------------------+
// 2026 (May 23rd) 22:03:24
// end signature
