#include <bits/stdc++.h>
using namespace std;
int main() {
    int N,K;cin>>N>>K;
    using pii=pair<int,int>;
    vector<array<int,3>>g(N+1);
    for(int i=1;i<=N;i++){
        int u,v,w;cin>>u>>v>>w;
        g[i]={u,v,w};
    }
    vector<int>best(K+1);
    for(int i=1;i<=K;i++)best[i]=0;
    for(int i=N;i>=1;i--){
        auto [u,v,w]=g[i];
        best[u]=max(best[u],best[v]+w);
    }
    int mx=0,cnt=0;
    for(int i=1;i<=K;i++)mx=max(mx,best[i]);
    for(int i=1;i<=K;i++)cnt+=best[i]==mx;
    cout<<mx<<endl<<cnt<<endl;
}

// begin signature
// +----------------------------------------+
// |覇覇覇慶群耗李労汎山山せ山允洪和奏慶覇覇|
// |覇慶奏李汎山火丁シㇵ一ㇵヘミビ允労奏慶覇|
// |群李山ビヘㇵ・ㇸㇵヘㇵヘ一　ㇵ丁允李群慶|
// |汎ビㇵ一・ㇵㇸ・ㇵヘヘㇵㇵヘヘㇵ火允労奏|
// |ビㇸ一　ヘ　　ㇸ　ㇸㇸ　　ㇸ・ㇸ一ミ火洪|
// |シ・ㇸ・ミミ・・シ　ヘ丁ビ丁シ・一一・ミ|
// |ミ・ㇸ・ビㇵㇸㇵヘ一ㇸヘシ丁せせミㇸㇵㇵ|
// |ミ・・・丁　ㇸシ一ㇵ丁せ允汎汎允山せヘ・|
// |ㇵ一ミビ一ヘ・ミ・ビ汎李李李耗奏和洪せシ|
// |ヘせせㇵㇵ一ミ・丁山火ビ火せ允労耗耗洪ビ|
// |允山ㇵㇸㇵㇵㇵヘシビせ允允允せ山洪汎洪火|
// |汎ミㇸㇵㇸシ・ミ汎山ビ丁ミミビ丁ミミ丁火|
// |汎シㇸ・ヘ一ヘ一ビヘ・・ㇸㇸ　　ㇸㇸ　ㇸ|
// |火火・一シヘ一ヘ・・シビ火火ビ丁火せ火丁|
// |　シ丁・・ヘミ　シヘ火汎労和洪せミヘㇵシ|
// |丁一・一・シ山丁　ミ允和群李山シ・一ヘㇵ|
// |允ヘミシ・ミ山ㇵヘ山和義奏汎ミ　ミせ允山|
// |火ミ汎ビ一一シ一せ和慶群汎ミ・ビ洪和耗李|
// |ビせ洪ビ丁丁　ビ労義陽労丁　ビ労陽覇義李|
// |せ汎李山火ヘㇵ山耗覇奏允ヘㇵ山耗覇覇陽洪|
// +----------------------------------------+
// 2026 (May 2nd) 18:24:07
// end signature

