#include <bits/stdc++.h>
using namespace std;
int main() {
    int T;cin>>T;
    while(T--){
        int N,M;cin>>N>>M;
        vector<vector<int>>g(N+1);
        for(int i=1;i<=M;i++){
            int u,v;cin>>u>>v;
            g[u].push_back(v);
            g[v].push_back(u);
        }
        vector<int>depth(N+1,-1);
        function<void(int)>dfs=[&](int u){
            for(auto v:g[u]){
                if(depth[v]==-1){
                    depth[v]=depth[u]+1;
                    dfs(v);
                }
            }
        };
        depth[1]=0;dfs(1);
        for(int i=1;i<=N;i++)cout<<depth[i]<<" ";cout<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |群耗李洪允山せ火ビ丁ミミミ丁ビせ山汎李和|
// |和洪允せビミシヘㇵ一ㇸㇸ一ㇵヘミ火山汎洪|
// |允火丁ヘ一ㇸ・　ㇸ一ㇸㇸㇸ　ㇸヘミ火火火|
// |丁ヘㇸ・・ㇸ一一・　　・・　・ㇸヘシシシ|
// |ヘ・ㇸ　一ㇸ　ㇸ　・・　　・ㇸ・・・　　|
// |ㇵ　一・一　一　ㇵヘシシヘ一・ㇸ一ㇵヘヘ|
// |ㇵ　一・ㇸㇸ・ㇸヘ丁火火火ビシミ丁丁ビビ|
// |ㇵ　ㇸ・ㇸ　ㇸヘミ火允汎汎允せ火山山山允|
// |一・一ㇵ一一シビせ允労和和李汎汎労労洪山|
// |ㇸシミ一ヘ丁せ山允労奏陽群和洪和奏耗労允|
// |ミミㇵシ火山ビ山労奏義慶群李耗陽陽耗洪せ|
// |丁ㇵシ火火ミビ允李奏陽群和労耗耗和李允ビ|
// |丁一ミ火ミ一ミせ汎李和李洪汎労洪洪汎山丁|
// |ミヘシ火シ・ㇸミ火山汎汎允せ山山せ火火ミ|
// |ビヘㇵビシ・一　ㇵミビ火火丁丁ビミシシシ|
// |火ミシミヘㇸㇸㇵ・ㇸヘ丁火山ビシ一・　　|
// |火せせ丁一ㇸㇸ・　ヘビ山允火シㇸ・ㇵヘㇵ|
// |汎允ビヘ　　ㇸ・ヘビ允汎火ヘ　一ミビビ丁|
// |洪火シ　ヘ一　ㇵビ允汎火シ　ㇵビ山汎允火|
// |允ビㇵ・ミㇵㇸミせ洪山丁一ㇸミ山労李汎火|
// +----------------------------------------+
// 2026 (July 12th) 20:27:28
// end signature
