#include <bits/stdc++.h>
using namespace std;
int main() {
    int T;cin>>T;
    while(T--){
        string S;cin>>S;
        vector<char>st;
        for(int i=S.size()-1;i>=0;i--){
            char c=S[i];
            if(st.size()>=2&&st[st.size()-2]=='C'&&st[st.size()-1]=='B'&&c=='A'){
                st.pop_back();st.pop_back();
            }else if(st.size()>=1&&st[st.size()-1]=='B'&&c=='A'){
                st.pop_back();
            }else if(c=='A'){
                // nothing
            } else {
                st.push_back(c);
            }
            // for(auto v:st)cout<<v;cout<<endl;
        }
        cout<<st.size()<<endl;
    }
}

// begin signature
// +----------------------------------------+
// |群耗李洪允山せ火ビ丁ミミ丁丁ビせせ山允汎|
// |和洪允せビミシヘㇵ一ㇸㇸ一ㇵヘシミ丁ビせ|
// |允火丁ヘ一ㇸ・　ㇸ一一一ㇸ　ㇸ一ㇸㇵシ丁|
// |丁ヘㇸ・・・一　・ㇸ一ㇸ・　・ㇸ一　一シ|
// |ヘ・ㇸ　一・ㇸ一　・・　　ㇸ・・ㇸ一・ㇸ|
// |ㇵ　一・一・一　一ㇵシシヘ一・ㇸㇸ・　　|
// |ㇵ　一・ㇸㇸㇸㇸヘ丁火火火ビシミ丁ミシ一|
// |ㇵ　ㇸ・ㇸㇸ・一ミ火允汎汎允せ火山山せビ|
// |一・ㇸ一　・　ヘビ允労和和李汎汎労労洪山|
// |　・　ㇸㇸ・ㇵビ允労奏陽群和洪和奏耗労允|
// |　・ㇵ・一ㇸミ山労奏義慶群李耗陽陽耗洪せ|
// |・・ㇸ一・ㇵビ允李奏陽群和労耗耗和李允せ|
// |　　一ㇸㇸㇸミせ汎李和和洪汎労洪洪汎山山|
// |・　・・一ㇸ一ミ火山汎汎允せ山山せ火火せ|
// |ミㇸ　・ㇸㇸ一・ヘミビ火火ビミビミシシシ|
// |せミ一　・ㇸㇸㇵ　ㇸㇵヘヘヘヘシ一・　　|
// |允火ミ一　ㇸㇸ・ㇸ　　　　ㇵシㇸ・ㇵヘㇵ|
// |汎せビシㇵ　ㇸ・ㇸㇵヘ一ㇵヘ　一ミビビ丁|
// |洪允せビシ一　ㇸミ火丁ㇵシ　ㇵビ山汎允火|
// |和洪山火ミㇵ　ヘビせミヘ一ㇸミ山労李汎火|
// +----------------------------------------+
// 2026 (July 12th) 20:40:53
// end signature
