#include "prison.h"
#include <bits/stdc++.h>
using namespace std;
vector<vector<int>> devise_strategy(int N) {
    vector<vector<int>>strat(60+1,vector<int>(N+1));
    strat[0][0]=0;strat[0][N]=-2;
    for(int i=1;i<=N-1;i++)strat[0][i]=11+i/10;
    for(int i=11;i<=60;i++){
        int ten=(i-11)*10;
        strat[i][0]=1;
        for(int j=1;j<=N-1;j++){
            if(j/10<ten/10)strat[i][j]=-2;
            else if(j/10>ten/10)strat[i][j]=-1;
            else strat[i][j]=j%10+1;
        }
        strat[i][N]=-1;
    }
    for(int i=1;i<=10;i++){
        int dig=i-1;
        strat[i][0]=0;
        for(int j=1;j<=N-1;j++){
            if(j%10<dig)strat[i][j]=-1;
            else if(j%10>dig)strat[i][j]=-2;
            else strat[i][j]=0; // impossible
        }
    }
    return strat;
}

// begin signature
// +----------------------------------------+
// |覇覇陽奏和労汎允允允汎労李奏陽覇覇覇覇覇|
// |義奏李汎山火丁ミミ丁ビせ允労耗陽覇覇覇覇|
// |李汎火ミㇵㇸシ丁ビ火火ビ火汎李群覇覇覇覇|
// |せミ一ㇸシ火允汎労労洪汎山せ洪耗慶覇覇覇|
// |ミㇸㇸミ山洪和奏群群群耗李洪汎李群覇覇覇|
// |ヘ・ㇵ火汎和群慶義陽陽陽陽奏奏和李群慶覇|
// |シ・ㇵ火洪耗義義奏和和群群和労汎汎洪和群|
// |シ・一火洪奏義奏李労李耗奏耗耗耗和洪せ洪|
// |ㇵㇸヘせ李陽奏労山火允洪洪汎允允汎洪労汎|
// |　ㇸビ洪奏群労せ火汎山火丁ミミミ丁火山汎|
// |・シ允和陽李せ火火ミㇵㇸ　　　・一ヘ丁せ|
// |・丁汎奏耗洪火ミ一　ㇵシミミミシ一　ㇵ丁|
// |　ミ允和洪せシ・一ミ火山允允允山火ミ一ㇸ|
// |・・丁允汎ビㇵ・ミせ汎労和耗労汎山山火シ|
// |ビ一　ミ山火ㇵ一丁允李奏群李允火ミシヘシ|
// |汎ビㇵ　シビ一ㇵ火洪耗義奏洪せシㇸ　ㇸㇸ|
// |李允丁ㇵ・ミ　ミ允和陽陽李山ミ・ㇵ丁ビビ|
// |耗洪せ丁ㇵ・シ山李陽義和山ミ　シせ汎洪允|
// |奏李汎火一ㇵせ労陽慶耗允ミ　ミ允和奏和汎|
// |義耗允ミ　ミ允耗慶陽労せㇵ一火労群義和允|
// +----------------------------------------+
// 2026 (July 4th) 11:44:45
// end signature


